import b1 from "./images/1.webp";
import b2 from "./images/2.webp";
import b3 from "./images/3.webp";
import b4 from "./images/4.webp";
import b5 from "./images/5.webp";
import b6 from "./images/6.webp";
import b7 from "./images/7.webp";
import rev1 from "./images/reviews/rev1.webp";
import rev2 from "./images/reviews/rev2.webp";

export const thanksPageForBlaster = [];

export const pageConfigBlaster = {
    "title": "Водяний бластер з функцією всмоктування води на акумуляторі",
    "content": [
      {
        "type": "basicHeaderBlock",
        "title": "Водяний бластер з функцією всмоктування води на акумуляторі"
      },
      {
        "type": "promoBlock",
        "src": b1,
        "oldPrice": "1370",
        "newPrice": "699"
      },
      {
        "type": "timerBlock",
        "text": "Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам надасть наш менеджер. Ваша розмова може бути записана з метою покращення якостi обслуговування."
      },
      {
        "type": "descriptionBlock",
        "title": "Водний бластер дитячий електричний водяний пістолет на акумуляторі ",
        "subtitle": "Водяний бластер – це іграшка, яка є найсучаснішою версією водного пістолета. Він використовує електричну потужність для високого тиску та розпилення води на цілі. Іграшка легка та нескладна у використанні, має точний приціл та потужний акумулятор, завдяки якому можна довго грати.",
        "firstImage": b2,
        "marquee": "Акційна пропозиція! ☘️ ЗНИЖКА -49% ☘️",
        "descrList": [
          {
            "type": "photo"
          },
          {
            "type": "text",
            "boldType": "Водяний бластер з функцією всмоктування води",
            "descr": "— це ідеальний вибір для тих, хто шукає захоплюючу та безпечну розвагу для відпочинку на воді."
          },
          {
            "type": "photo",
            "image": b3
          },
          {
            "type": "text",
            "boldType": "Цей бластер ",
            "descr": "виготовлений з якісного ABS-пластика, що забезпечує його довговічність і надійність."
          },
          {
            "type": "photo",
            "image": b4
          },
          {
            "type": "text",
            "boldType": "Бластер електричний",
            "descr": "призначений для дітей та дорослих, які хочуть додати у своєму житті веселощі та активність"
          },
          {
            "type": "photo",
            "image": b5
          },
          {
            "type": "text",
            "boldType": "Особливістю цього водяного бластера",
            "descr": "є його здатність метати воду, що робить його ідеальним для ігор на пляжі, в басейні чи на вечірках."
          },
          {
            "type": "photo",
            "image": b6
          },
          {
            "type": "text",
            "boldType": "Знімні деталі ",
            "descr": "озволяють легко розбирати і збирати бластер, що додає грі додатковий інтерес.  Бластер працює від акумулятора, що забезпечує його мобільність та зручність використання.  Метання води, механічний рух та світлові ефекти додадуть вашій грі додаткову динаміку та інтерес."
          },
          {
            "type": "advantages",
            "titleAdvantage": "Особливості:",
            "listAdvantage": [
              "- Легкий та зручний у використанні",
              "- Тривала батарея",
              "- Міцний, удароміцний та водонепроникний матеріал",
              "- Яскравий та привабливий дизайн",
              "- Безпечний, тому що склад не містить шкідливих хімічних речовин.",
              "- Тривала робота",
              "- Насос",
            ]
          },
          {
            "type": "photo",
            "image": b7
          },
          {
            "type": "advantages",
            "titleAdvantage": "Комплектація:",
            "listAdvantage": [
              "- 1 х бластер",
              "- 1 х USB провід",
              "- 1 х акумуляторна батарея"
            ]
          }
        ]
      },
      {
        "type": "detailsBlock",
        "details": [
          {
            "title": "Матеріал корпусу:",
            "descr": "ABS + РР"
          },
          {
            "title": "Робота від:",
            "descr": "акумулятор"
          },
          {
            "title": "Зарядка:",
            "descr": "USB"
          },
          {
            "title": "Водостійкість:",
            "descr": "IP7"
          },
          {
            "title": "Дальність пострілу:",
            "descr": "8-10 м"
          },
          {
            "title": "Розмір:",
            "descr": "43 х 19 х 6.5 см"
          },
          {
            "title": "Батарея:",
            "descr": "14500/3.7V/500 mAh"
          }
        ]
      },
      {
        "type": "questionBlock",
        "title": "Водний бластер"
      },
      {
        "type": "viber",
        "title": "Відгуки покупців",
        "images": [rev1, rev2]
      },
      {
        "type": "orderBlock",
        "title": "Водяний бластер з функцією всмоктування води",
        "image": b1,
        "oldPrice": "1370",
        "newPrice": "699",
        "defaultSize": {         
            "size": "default",
            "id": "id_715742"
        },
        "sizeProduct": [
            
        ],
        "quantityList": [
          {
            "value": 1,
            "message": "",
            "price": "389"
          },
          {
            "value": 2,
            "message": "",
            "price": "739"
          },
          {
            "value": 3,
            "message": "",
            "price": "1050"
          },
          {
            "value": 4,
            "message": "",
            "price": "1322"
          }
        ]
      }
    ]
}