import React from 'react';
import "./info.scss";

export const Info = () => {
  return (
    <div className="info" id="info">
        <h2>Опис:</h2>
        <span>
          Світильник-проектор Астронавт Nebula RGB - світильник має безліч режимів 
          колірного зображення космічного неба, що дає змогу створювати неповторну 
          атмосферу в будь-якому приміщенні. Зображення-проекція виходить дуже чітким 
          і реалістичним, прекрасно передаються всі деталі і яскравість картинки. 
          Фігурка з регульованою головою дає змогу змінювати її положення і напрямок 
          проекції, що робить використання ще зручнішим. Управління нічником інтуїтивно 
          зрозуміле і зручне, а наявність пульта дистанційного керування робить 
          експлуатацію ще простішою. Стильний дизайн світильника легко впишеться в 
          будь-який інтер'єр. Це ідеальне поєднання функціональності, стилю і сучасних 
          технологій, яке стане справжньою окрасою вашого будинку.
        </span>
    </div>
  )
}
