import React from 'react';
import descr1 from "../../images/course/2.png";
import descr2 from "../../images/course/3.png";
import descr4 from "../../images/course/4.png";
import "./DescrProd.scss";

export const DescrProd = () => {
    return (
        <div className="descr-wrapper">
            <div className="descr-wrapper-title">
                <h2>
                    Ти коли-небудь мріяв про кубики пресу ?
                </h2>
            </div>
            <div className="descr-wrapper-subtitle">
                <span>
                    Цей компактний і легкий тренажер включає в себе три ключові елементи: дошку для планки, 
                    платформу для віджимань та трубчастий еспандер. Поєднуючи ці елементи, тренажер пропонує 
                    повноцінне тренування, яке охоплює не тільки м'язи пресу, а й руки, ноги, грудні м'язи, сідниці та спину.
                </span>
                <img src={descr2} alt="" />
            </div>
            <div className="descr-wrapper-text">
                <span>
                    <span className="special-text">Дошка для планки: </span> М'які підлокітники та нековзні ручки забезпечують комфорт та зручність під час виконання вправ. 
                    Вбудований таймер та місце для телефону дозволяють відстежувати час тренування та звільняють від необхідності контролювати час.
                </span>
                <span>
                    <span className="special-text">Платформа для віджимань: </span> Сім різних положень для регулювання кута навантаження допомагають націлювати 
                    тренування на різні групи м'язів. Вставні ручки дозволяють легко змінювати положення, збільшуючи ефективність тренувань.
                </span>
                <span>
                    <span className="special-text">Трубчастий еспандер:</span> Ідеальний для тренування м'язів рук і зап'ясть. 
                    Легко приєднується до основи платформи, пропонуючи різноманітні варіанти вправ.
                </span>

                <img src={descr1} alt="" />

                <span>
                    Фітнес-тренажер для пресу LK202310-17 є ідеальним вибором для тих, хто прагне підтримувати фізичну форму та займатися спортом вдома.
                </span>

                <img src={descr4} alt="" />

                <span>
                    Він займає мало місця, легко переміщується та зберігається, що робить його незамінним помічником у домашніх тренуваннях. 
                    На відміну від звичайного ролика для пресу, цей тренажер пропонує різноманіття вправ та можливість тренувати різні групи 
                    м'язів, роблячи кожне тренування максимально ефективним.
                </span>
            </div>
        </div>
    )
}
