import React from 'react';
import "./info.scss";

export const Info = () => {
  return (
    <div className="info" id="info">
        <h2>Опис:</h2>
        <span>
          Акумуляторна лампа для кемпінгу CG-30W 1500mAh для аварійного освітлення у 
          квартирі чи офісі максимально наближає до звичайного повсякденного освітлення. 
          Завдяки гачку ви можете підвісити його на люстру, вішалку чи шафу, що дозволить 
          використовувати його з максимальною ефективністю. Наявність трьох режимів 
          освітлення допоможе підібрати найбільш комфортне світло для ваших умов. Повного 
          заряду акумулятора вистачає приблизно на 4-6 годин безперервної роботи. Після 
          чого ви завжди можете підключити павербанк. Заряджається від кабелю USB, що йде 
          в комплекті. Можна заряджати через розетку, ноутбук, павербанк та сонячну панель.
        </span>
    </div>
  )
}
