// pink color for robe
import asian1 from "../helpers/images/asian-prod/1.jpg";
import asian2 from "../helpers/images/asian-prod/2.jpg";
import asian3 from "../helpers/images/asian-prod/3.jpg";
import asian4 from "../helpers/images/asian-prod/4.jpg";
import asian5 from "../helpers/images/asian-prod/5.jpg";
import asian6 from "../helpers/images/asian-prod/6.jpg";
import asian8 from "../helpers/images/asian-prod/8.jpg";
import asian9 from "../helpers/images/asian-prod/9.jpg";

export const cardsProductsAsian = [
	{
		id: 2,
		images: [asian1, asian4, asian2, asian3, asian5, asian6, asian8, asian9],
		oldPrice: 999,
		price: 780,
		article: "SM2268",
		sale: "47%",
		color: "чорний",
		backgroundColor: "",
		size: ["S", "M", "L", "XL"],
		material: "",
	},
];

// export const cardsProductsManRobe = null;

export const prodTitleAsian =
	"Спокусливе боді та спідничка з відкритим доступом";

export const costAsian = {
	old: 999,
	new: 780,
};

export const infoAsian =
	"Цей комплект з еротичним боді – ідеальний вибір для тих, хто хоче виглядати неперевершено та почуватися впевнено. Він допоможе створити незабутню атмосферу та додати розкоші у ваші особливі моменти.";

export const detailsTitleAsian = "Опис";

export const detailsForAsian = [
	{
		title: "Матеріал: ",
		descr: "фатин, мережево",
	},
	{
		title: "Розміри (маломір): ",
		descr: "S, M, L, XL",
	},
	{
		title: "Комплект",
		descr: "боді  + спідничка",
	},
	{
		title: "Преміальная якість",
		descr: "",
	},
	{
		title: "Aкційна ціна",
		descr: "",
	},
];

export const equipmentForAsian = [
	"🔥 Спокусливий та дуже ніжний образ",
	"🔥 Мереживний боді з відкритим доступом",
	"🔥 Бюст на кісточках, застібка на два гачки",
	"🔥 Міні-спідничка з фатину",
	"🔥 Великий вибір розмірів – підберемо саме під вашу фігуру",
	"🔥 Тканина стійка до зносу і прання, не втрачає вигляд навіть після багаторазового використання",
];

export const equipmentTitleForAsian = "Переваги";

export const reviewsForAsian = [
	{
		rating: "5",
		name: "Аліна В.",
		text: "😍😍😍",
	},
	{
		rating: "5",
		name: "Олена О.",
		text: "Розмір підійшов, дякую!",
	},
	{
		rating: "5",
		name: "Світлана О.",
		text: "Швидка доставка, дякую менеджеру за допомогу 😘💋",
	},
	{
		rating: "5",
		name: "Єва К.",
		text: "Дууууууже дякую, просто шикарний комплект",
	},
	{
		rating: "5",
		name: "Катерина Д.",
		text: "Підійшов просто ідеально 😍",
	},
	{
		rating: "5",
		name: "Діана Б.",
		text: "Інколи купую такі комплекти, від цього я просто в захваті, дуже зручний, ставлю 5 зірочок )",
	},
	{
		rating: "5",
		name: "Діана Н.",
		text: "👍🏻👍🏻👍🏻👍🏻👍🏻",
	},
	{
		rating: "5",
		name: "Каріна С.",
		text: "",
	},
	{
		rating: "5",
		name: "Вікторія С.",
		text: "Цілком задоволена, дякую",
	},
	{
		rating: "5",
		name: "Мілана Ю.",
		text: "Дуже круто виглядає😍😍",
	},
	{
		rating: "5",
		name: "Олександра П.",
		text: "100 з 10 це просто ідеально!",
	},
];

export const marqueeAsian = "ВСТИГНИ ПРИДБАТИ ЗІ ЗНИЖКОЮ ВІД ";

export const colorForAsian = [];

export const sizeForAsian = [
	{
		sm: "S",
		old: 2070,
		new: 1099,
		color: ["рожевий", "сірий", "молочний", "шоколад"],
	},
	{
		sm: "M",
		old: 2070,
		new: 1099,
		color: ["рожевий", "сірий", "молочний", "шоколад"],
	},
	{
		sm: "L",
		old: 2070,
		new: 1099,
		color: ["рожевий", "сірий", "молочний", "шоколад"],
	},
	{
		sm: "XL",
		old: 2070,
		new: 1099,
		color: ["рожевий", "сірий", "молочний", "шоколад"],
	},
];

export const ten = null;
