import h1 from "./images/1.webp";
import h2 from "./images/2.webp";
import h3 from "./images/3.webp";
import h4 from "./images/4.webp";
import h5 from "./images/5.webp";
import h6 from "./images/6.webp";

import d1 from "./images/dop/1.webp";
import d2 from "./images/dop/2.webp";
import d3 from "./images/dop/3.webp";
import d4 from "./images/dop/4.webp";
import d5 from "./images/dop/5.webp";
import d6 from "./images/dop/6.webp";
import d7 from "./images/dop/7.webp";
import d8 from "./images/dop/8.webp";
import d9 from "./images/dop/9.webp";
import d10 from "./images/dop/10.webp";
import d11 from "./images/dop/12.webp";

import v1 from "./images/reviews/v1.webp";
import v2 from "./images/reviews/v2.webp";

export const thanksPageForHose = [
    
    {
        id: 7,
        images: [d4, d5, d6],
        title: "Ручна бездротова газонокосарка Zip Trim",
        old: "498",
        new: "249",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        id: "id_715552",
        details: [
            {
                t: "Простота у використанні;",
                d: ""
            },
            {
                t: "Компактний розмір, не займає багато місця;",
                d: ""
            },
            {
                t: "Дуже легка вага;",
                d: ""
            },
            {
                t: "Не потребує проводів та бензину;",
                d: ""
            },
            {
                t: "Можливість косити траву у важкодоступних місцях (огорож, бордюр, область навколо дерев тощо)",
                d: ""
            },
            {
                t: "Матеріал:",
                d: "пластик + алюмінієвий сплав;"
            },
            {
                t: "Живлення від батарейок: ",
                d: "6 x AA (не входять до комплекту);"
            },
            {
                t: "Вага: ",
                d: "180 г (без батарейок), вага подовженої основи 100 г;"
            },
            {
                t: "Довжина ручки тримача: ",
                d: "58,5 см."
            },
        ],
    },
    {
        id: 5,
        images: [d7, d8, d9],
        title: "Професійний щеплений секатор Grafting Tool з 3 ножами для обрізання та щеплення дерев",
        old: "599",
        new: "299",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        id: "id_715554",
        details: [
            {
                t: "ніж забезпечує найбільш міцне з'єднання прищею з підщепою, при цьому виключаючи ймовірність зміщення.",
                d: ""
            },
            {
                t: "Найголовніша відмінність секатора для щеплення від різних спеціальних ножів це те, що місце з'єднання гілок рослини виходить щільним і зріз завжди виходить однаковий.",
                d: ""
            },
            {
                t: "Комплектація: ",
                d: "щеплювальний секатор з трьома ножами (один встановлений у щеплювальний секатор і два окремо) та запасним упорним барабаном."
            },
            
        ],
    },
    {
        id: 8,
        images: [d1, d2, d3],
        title: "Степлер Тапенер Tapetool для підв'язки",
        old: "800",
        new: "420",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        id: "id_715553",
        details: [
            {
                t: "Не залишає після підв'язки шматок стрічки (Scrap Free);",
                d: ""
            },
            {
                t: "Легке натискання;",
                d: ""
            },
            {
                t: "Більш тривалий термін служби;",
                d: ""
            },
            {
                t: "В 3-5 разів прискорює процес підв'язки рослин.",
                d: ""
            },
            {
                t: "зберігайте від забруднень;",
                d: ""
            },
            {
                t: "уникайте зберігання інструменту у вологому середовищі.",
                d: ""
            },
        ],
    },
    {
        id: 6,
        images: [d10],
        title: "Рулетка будівельна 5м x 16мм Tape measure AND 240PCS 5M",
        old: "198",
        new: "99",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        id: "id_715555",
        details: [
            {
                t: "Тип: ",
                d: "Рулетка;"
            },
            {
                t: "Призначення :  ",
                d: "для вимірювальних робіт;"
            },
            {
                t: "Матеріал: ",
                d: "Пластик, Сталь;"
            },
            {
                t: "Розмір стрічки: ",
                d: "5м х 16мм;"
            },
            {
                t: "Ширина:",
                d: "16мм;"
            },
            {
                t: "Вага: ",
                d: "150г."
            },
        ],
    },
    {
        id: 1,
        images: [d11],
        title: "Пила Ручна SawAND",
        old: "398",
        new: "249",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        id: "id_715379",
        details: [
            {
                t: "Ручна пилка Saw AND це ідеальний інструмент для виконання різних робіт у будинку та на природі.",
                d: ""
            },
            {
                t: "Ця пилка має високу якість і надійність, що робить її ідеальним вибором для професіоналів та любителів",
                d: ""
            },
            {
                t: "Легкий та компактний дизайн дозволить вам легко переносити інструмент із собою",
                d: ""
            },
            {
                t: "пилка Saw AND має зручну ручку, що забезпечує хорошу керованість і комфорт під час роботи",
                d: ""
            },
        ],
    },
];

export const pageConfigHose = {
    "title": "Шланг садовий поливальний X-hose",
    "content": [
      {
        "type": "basicHeaderBlock",
        "title": "Шланг садовий поливальний X-hose"
      },
      {
        "type": "promoBlock",
        "src": h1,
        "oldPrice": "515",
        "newPrice": "299"
      },
      {
        "type": "timerBlock",
        "text": "Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам надасть наш менеджер. Ваша розмова може бути записана з метою покращення якостi обслуговування."
      },
      {
        "type": "descriptionBlock",
        "title": "Шланг для поливу з розпилювачем X-Hose",
        "subtitle": "Для покупки доступна різна довжина шлангу - 15м., 30м., 45м., 60м., 75м., 90м., 120м., підберемо під будь-яку Вашу потребу!",
        "firstImage": h2,
        "marquee": "Акційна пропозиція! ☘️ ЗНИЖКА -42% ☘️",
        "descrList": [
          
          {
            "type": "text",
            "boldType": "Шланг садовий поливальний X-hose ",
            "descr": "–  це нове покоління поливальних шлангів. Це шланг-гармошка, який розтягується та випрямляється в момент подачі води. Довжина шланга може збільшуватися до триразового розміру, а після використання знову зменшиться для зручності зберігання."
          },
          {
            "type": "photo",
            "image": h3
          },
          {
            "type": "text",
            "boldType": "Водяний шланг&X X Hose",
            "descr": "компактний, легкий та еластичний, що виключає утворення заломів та петель. Не дивлячись на свої, здавалося б, скромні розміри великий діаметр городнього шланга сприяє створенню потужного, інтенсивного розпилення та поливу."
          },
          {
            "type": "photo",
            "image": h4
          },
          {
            "type": "text",
            "boldType": "За рахунок своєї здатності змінювати довжину",
            "descr": "шланг можна використовувати для догляду за розсадою, квітами та газоном на дачній ділянці або в саду, для миття вікон або фасадів будинків, для миття автомобіля, прибирання гаража та інших потреб."
          },
          {
            "type": "photo",
            "image": h5
          },
          {
            "type": "advantages",
            "titleAdvantage": "Переваги:",
            "listAdvantage": [
              "- Подовжується при пос тупленні води",
              "- Після використання автоматично приймає вихідний розмір",
              "- Не заламується, не перекручується, не плутається",
              "- Надміцний та зносостійкий",
              "- Здатний ефективно працювати з використанням підсилювача напору",
              "- Легкий, компактний, зручний у зберіганні",
            ]
          },
          {
            "type": "photo",
            "image": h6
          },
          {
            "type": "advantages",
            "titleAdvantage": "Комплектація:",
            "listAdvantage": [
              "- Шланг XHose",
              "- Розпилювач",
              "- Коробка"
            ]
          }
        ]
      },
      {
        "type": "detailsBlock",
        "details": [
          {
            "title": "Матеріал шлангу:",
            "descr": "латекс та тканинне поліефірне полотно"
          },
          {
            "title": "Матеріал арматури:",
            "descr": "АБС-пластик"
          },
          {
            "title": "Матеріал розпилювача:",
            "descr": "пластик"
          },
          {
            "title": "Діаметр:",
            "descr": "70 мм"
          },
          {
            "title": "Колір:",
            "descr": "синій"
          }
        ]
      },
      {
        "type": "questionBlock",
        "title": "Шланг для поливу"
      },
      {
        "type": "viber",
        "title": "Відгуки покупців",
        "images": [v1, v2]
      },
      {
        "type": "orderBlock",
        "title": "Шланг садовий поливальний X-hose",
        "image": h1,
        "oldPrice": "515",
        "newPrice": "299",
        "productId": "id_715372", // ENTER ID PRODUCT !!!!!!!
        "defaultSize": {         
            "size": "15м.",
            "id": "id_715372"
        },
        "sizeProduct": [
            {
                "size": "15м.",
                "priceOld": 515,
                "priceNew": 299,
                "initId": "id_715372"
            },
            {
                "size": "30м.",
                "priceOld": 595,
                "priceNew": 379,
                "initId": "id_715445"
            },
            {
                "size": "45м.",
                "priceOld": 690,
                "priceNew": 449,
                "initId": "id_715446"
            },
            {
                "size": "60м.",
                "priceOld": 740,
                "priceNew": 519,
                "initId": "id_715447"
            },
            {
                "size": "75м.",
                "priceOld": 830,
                "priceNew": 579,
                "initId": "id_715448"
            },
            {
                "size": "90м.",
                "priceOld": 950,
                "priceNew": 679,
                "initId": "id_715449"
            },
            {
                "size": "120м.",
                "priceOld": 1020,
                "priceNew": 749,
                "initId": "id_715450"
            },
        ],
        "quantityList": [
          {
            "value": 1,
            "message": "",
            "price": "389"
          },
          {
            "value": 2,
            "message": "",
            "price": "739"
          },
          {
            "value": 3,
            "message": "",
            "price": "1050"
          },
          {
            "value": 4,
            "message": "",
            "price": "1322"
          }
        ]
      }
    ]
}