import h1 from "./images/1.webp";
import h2 from "./images/2.webp";
import h3 from "./images/3.webp";
import h4 from "./images/4.webp";
import h5 from "./images/5.webp";
import h6 from "./images/6.webp";

export const pageConfigHose = {
    "title": "Шланг садовий поливальний X-hose",
    "content": [
      {
        "type": "basicHeaderBlock",
        "title": "Шланг садовий поливальний X-hose"
      },
      {
        "type": "promoBlock",
        "src": h1,
        "oldPrice": "515",
        "newPrice": "299"
      },
      {
        "type": "timerBlock",
        "text": "Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам надасть наш менеджер. Ваша розмова може бути записана з метою покращення якостi обслуговування."
      },
      {
        "type": "descriptionBlock",
        "title": "Шланг для поливу з розпилювачем X-Hose",
        "subtitle": "Для покупки доступна різна довжина шлангу - 15м., 30м., 45м., 60м., 75м., 90м., 120м., підберемо під будь-яку Вашу потребу!",
        "firstImage": h2,
        "marquee": "Акційна пропозиція! ☘️ ЗНИЖКА -42% ☘️",
        "descrList": [
          
          {
            "type": "text",
            "boldType": "Шланг садовий поливальний X-hose ",
            "descr": "–  це нове покоління поливальних шлангів. Це шланг-гармошка, який розтягується та випрямляється в момент подачі води. Довжина шланга може збільшуватися до триразового розміру, а після використання знову зменшиться для зручності зберігання."
          },
          {
            "type": "photo",
            "image": h3
          },
          {
            "type": "text",
            "boldType": "Водяний шланг&X X Hose",
            "descr": "компактний, легкий та еластичний, що виключає утворення заломів та петель. Не дивлячись на свої, здавалося б, скромні розміри великий діаметр городнього шланга сприяє створенню потужного, інтенсивного розпилення та поливу."
          },
          {
            "type": "photo",
            "image": h4
          },
          {
            "type": "text",
            "boldType": "За рахунок своєї здатності змінювати довжину",
            "descr": "шланг можна використовувати для догляду за розсадою, квітами та газоном на дачній ділянці або в саду, для миття вікон або фасадів будинків, для миття автомобіля, прибирання гаража та інших потреб."
          },
          {
            "type": "photo",
            "image": h5
          },
          {
            "type": "advantages",
            "titleAdvantage": "Переваги:",
            "listAdvantage": [
              "- Подовжується при пос тупленні води",
              "- Після використання автоматично приймає вихідний розмір",
              "- Не заламується, не перекручується, не плутається",
              "- Надміцний та зносостійкий",
              "- Здатний ефективно працювати з використанням підсилювача напору",
              "- Легкий, компактний, зручний у зберіганні",
              "- Шланг XHose",
              "- Розпилювач",
              "- Коробка"
            ]
          },
          {
            "type": "photo",
            "image": h6
          },
          {
            "type": "advantages",
            "titleAdvantage": "Комплектація:",
            "listAdvantage": [
              "- Подовжується при пос тупленні води",
              "- Після використання автоматично приймає вихідний розмір",
              "- Не заламується, не перекручується, не плутається",
              "- Надміцний та зносостійкий",
              "- Здатний ефективно працювати з використанням підсилювача напору",
              "- Легкий, компактний, зручний у зберіганні",
              "- Шланг XHose",
              "- Розпилювач",
              "- Коробка"
            ]
          }
        ]
      },
      {
        "type": "detailsBlock",
        "details": [
          {
            "title": "Матеріал шлангу:",
            "descr": "латекс та тканинне поліефірне полотно"
          },
          {
            "title": "Матеріал арматури:",
            "descr": "АБС-пластик"
          },
          {
            "title": "Матеріал розпилювача:",
            "descr": "пластик"
          },
          {
            "title": "Діаметр:",
            "descr": "70 мм"
          },
          {
            "title": "Колір:",
            "descr": "синій"
          }
        ]
      },
      {
        "type": "questionBlock",
        "title": "Шланг для поливу"
      },
      {
        "type": "viber",
        "title": "Відгуки покупців",
        "images": []
      },
      {
        "type": "orderBlock",
        "title": "Шланг садовий поливальний X-hose",
        "image": h1,
        "oldPrice": "515",
        "newPrice": "299",
        "productId": "", // ENTER ID PRODUCT !!!!!!!
        "defaultSize": {         
            "size": "15м."
        },
        "sizeProduct": [
            {
                "size": "15м.",
                "priceOld": 515,
                "priceNew": 299,
            },
            {
                "size": "30м.",
                "priceOld": 595,
                "priceNew": 379,
            },
            {
                "size": "45м.",
                "priceOld": 690,
                "priceNew": 449,
            },
            {
                "size": "60м.",
                "priceOld": 740,
                "priceNew": 519,
            },
            {
                "size": "75м.",
                "priceOld": 830,
                "priceNew": 579,
            },
            {
                "size": "90м.",
                "priceOld": 950,
                "priceNew": 679,
            },
            {
                "size": "120м.",
                "priceOld": 1020,
                "priceNew": 749,
            },
        ],
        "quantityList": [
          {
            "value": 1,
            "message": "",
            "price": "389"
          },
          {
            "value": 2,
            "message": "",
            "price": "739"
          },
          {
            "value": 3,
            "message": "",
            "price": "1050"
          },
          {
            "value": 4,
            "message": "",
            "price": "1322"
          }
        ]
      }
    ]
}