import React from 'react';
import "./info.scss";

export const Info = () => {
  return (
    <div className="info" id="info">
        <h2>Опис:</h2>
        <span>
            Світильник настільний місяць 3D RGB - це унікальний декоративний аксесуар, 
            який точно повторює поверхню місяця з реалістичною 3D-текстурою. Він створить 
            атмосферу затишку і чарівництва в будь-якому приміщенні. Можливість вибору 
            різних режимів освітлення і кольорів за допомогою сенсорного управління або 
            пульта дає змогу легко налаштовувати світло під настрій або обстановку. 
            Вбудована батарея ємністю 300mAh забезпечує до 12 годин роботи без необхідності 
            в частому заряджанні. Такий нічник стане ідеальним доповненням до інтер'єру не 
            тільки спальні дорослих, а й у дитячій. І найменші зможуть спокійно засинати під його світлом.
        </span>
    </div>
  )
}
