import img1 from "./helpers/images/slider/img1.jpg";
import img2 from "./helpers/images/slider/img2.jpg";
import img3 from "./helpers/images/slider/img3.jpg";
import img4 from "./helpers/images/slider/img4.jpg";
import img5 from "./helpers/images/slider/img5.jpg";
import img6 from "./helpers/images/slider/img6.jpg";
import img7 from "./helpers/images/slider/img7.jpg";
import img8 from "./helpers/images/slider/img8.jpg";
import img9 from "./helpers/images/slider/img9.jpg";

import user1 from "./helpers/images/reviews/1.png";
import user2 from "./helpers/images/reviews/2.png";
import user3 from "./helpers/images/reviews/3.png";

import lamp1 from "./helpers/images/slider-lamp/1.jpg";
import lamp2 from "./helpers/images/slider-lamp/2.jpg";
import lamp3 from "./helpers/images/slider-lamp/3.jpg";
import lamp4 from "./helpers/images/slider-lamp/4.jpg";
import lamp5 from "./helpers/images/slider-lamp/5.jpg";
import lamp6 from "./helpers/images/slider-lamp/6.jpg";
import lamp7 from "./helpers/images/slider-lamp/7.jpg";
import lamp8 from "./helpers/images/slider-lamp/8.jpg";

import cosmos1 from "./helpers/images/slider-cosmos/1.jpg";
import cosmos2 from "./helpers/images/slider-cosmos/2.jpg";
import cosmos3 from "./helpers/images/slider-cosmos/3.jpg";
import cosmos4 from "./helpers/images/slider-cosmos/4.jpg";
import cosmos5 from "./helpers/images/slider-cosmos/5.jpg";
import cosmos6 from "./helpers/images/slider-cosmos/6.jpg";
import cosmos7 from "./helpers/images/slider-cosmos/7.jpg";
import cosmos8 from "./helpers/images/slider-cosmos/8.jpg";

export const sizeForGlobe = [
	{
		sm: 12,
		old: 840,
		new: 645,
	},
	{
		sm: 15,
		old: 980,
		new: 755,
	},
	{
		sm: 18,
		old: 1250,
		new: 975,
	},
];

export const prodTitleGlobe =
	"Світильник настільний Місяць 3D RGB + пульт";

export const nameProdGlobe = "Table lamp";

export const costGlobe = {
	old: 650,
	new: 465,
};

export const infoProdGlobe =
	"Світильник настільний місяць 3D RGB - це унікальний декоративний аксесуар, який точно повторює поверхню місяця з реалістичною 3D-текстурою. Він створить атмосферу затишку і чарівництва в будь-якому приміщенні. Можливість вибору різних режимів освітлення і кольорів за допомогою сенсорного управління або пульта дає змогу легко налаштовувати світло під настрій або обстановку. Вбудована батарея ємністю 300mAh забезпечує до 12 годин роботи без необхідності в частому заряджанні. Такий нічник стане ідеальним доповненням до інтер'єру не тільки спальні дорослих, а й у дитячій. І найменші зможуть спокійно засинати під його світлом.";

export const imagesForGlobeSlider = [
	img1,
	img2,
	img3,
	img4,
	img5,
	img6,
	img7,
	img8,
	img9,
];

export const detailsForGlobe = [
	{
		title: "М'яке світло",
		descr: "",
	},
	{
		title: "Кількість режимів:",
		descr: "16",
	},
	{
		title: "Ємність акумулятора:",
		descr: "300 mAh",
	},
	{
		title: "Час роботи:",
		descr: "від 8 до 12 годин",
	},
	{
		title: "Час заряджання:",
		descr: "до 3 годин",
	},
	{
		title: "Живлення:",
		descr: "від акумулятора/USB",
	},
	{
		title: "Сенсорний перемикач",
		descr: "",
	},
	{
		title: "Пульт дистанційного керування",
		descr: "",
	},
	{
		title: "Освітлює простір на 360 градусів",
		descr: "",
	},
	{
		title: "Діаметр:",
		descr: "8 см",
	},
];

export const equipmentForGlobe = [
	"Світильник настільний",
	"Пульт дистанційного керування",
	"Дерев'яна підставка",
	"USB кабель",
	"Інструкція",
];

export const reviewsForGlobe = [
	{
		name: "Богдан В.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user1,
		text: "Дуже подобається м'яке світло цього світильника у формі місяця. Завдяки 16 режимам можна вибрати ідеальне освітлення для будь-якого настрою. Сенсорний перемикач і пульт – супер зручні, особливо ввечері, коли вже не хочеться вставати з ліжка. Працює близько 10 годин на одному заряді, що для мене повністю вистачає!",
	},
	{
		name: "Світлана Г.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user2,
		text: "Цей світильник виглядає просто чудово! Компактний, лише 8 см в діаметрі, але світить доволі яскраво і охоплює всю кімнату завдяки освітленню на 360 градусів. Чудово тримає заряд і заряджається швидко – всього 3 години. Рекомендую для всіх, хто хоче додати трохи магії у свою кімнату!",
	},
	{
		name: "Олена А.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user3,
		text: "Сподобалося, що світильник працює як від акумулятора, так і від USB – дуже зручно. Вечорами він створює неймовірну атмосферу, а пульт дозволяє легко перемикати режими. Також приємно здивувала тривалість роботи, заряд тримається до 12 годин!",
	},
];

// ============================================== LAMP

export const sizeForLamp = null;

export const prodTitle = "Акумуляторна лампа для кемпінгу CG-30W 3000mAh";

export const nameProd = "Battery Lamp";

export const cost = {
	old: 505,
	new: 379,
};

export const infoProd =
	"Акумуляторна лампа для кемпінгу CG-30W 1500mAh для аварійного освітлення у квартирі чи офісі максимально наближає до звичайного повсякденного освітлення. Завдяки гачку ви можете підвісити його на люстру, вішалку чи шафу, що дозволить використовувати його з максимальною ефективністю. Наявність трьох режимів освітлення допоможе підібрати найбільш комфортне світло для ваших умов. Повного заряду акумулятора вистачає приблизно на 4-6 годин безперервної роботи. Після чого ви завжди можете підключити павербанк. Заряджається від кабелю USB, що йде в комплекті. Можна заряджати через розетку, ноутбук, павербанк та сонячну панель.";

export const imagesForLampSlider = [
	lamp1,
	lamp2,
	lamp3,
	lamp4,
	lamp5,
	lamp6,
	lamp7,
	lamp8,
];

export const detailsForLamp = [
	{
		title: "Місткість акумулятора:",
		descr: "3000 mAh",
	},
	{
		title: "Час роботи:",
		descr: "від 6 до 8 годин",
	},
	{
		title: "Час зарядки:",
		descr: "6 годин",
	},
	{
		title: "Колір:",
		descr: "білий",
	},
	{
		title: "Кількість режимів:",
		descr: "3 (яскраве, м'яке, миготіння)",
	},
];

export const equipmentForLamp = ["Крючок", "Кабель питания USB", "Лампа"];

export const reviewsForLamp = [
	{
		name: "Богдан В.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user1,
		text: "Довго шукав зручну лампу для походів, і ця мене не підвела. На одному заряді спокійно світить годин 6–8, що дуже зручно, коли ночуєш у наметі. Плюс є три режими, можна перемикати між яскравим і м'яким, а миготіння ще й як сигнал стане в пригоді. Для подорожей просто супер варіант!",
	},
	{
		name: "Світлана Г.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user2,
		text: "Ця лампа – справжній порятунок в наш час. Легко заряджається, а потім працює до 8 годин — вистачає на цілу ніч. М'яке світло для вечірнього зимового вайбу. Легка і зручна у використанні. Рекомендую всім!",
	},
	{
		name: "Олена А.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user3,
		text: "Маю цю лампу не лише для кемпінгу, але й про всяк випадок, коли вимикають електрику. Повністю заряджена тримає кілька годин, і навіть у яскравому режимі її вистачає на цілий вечір. Просто поставила на стіл і забула про темряву! Зручна річ, варта своєї ціни.",
	},
];

// ============================================== COSMOS

export const sizeForCosmos = null;

export const prodTitleCosmos =
	"Світильник-проектор Астронавт Nebula RGB + пульт";

export const nameProdCosmos = "Astronaut";

export const costCosmos = {
	old: 1100,
	new: 849,
};

export const infoProdCosmos =
	"Світильник-проектор Астронавт Nebula RGB - світильник має безліч режимів колірного зображення космічного неба, що дає змогу створювати неповторну атмосферу в будь-якому приміщенні. Зображення-проекція виходить дуже чітким і реалістичним, прекрасно передаються всі деталі і яскравість картинки. Фігурка з регульованою головою дає змогу змінювати її положення і напрямок проекції, що робить використання ще зручнішим. Управління нічником інтуїтивно зрозуміле і зручне, а наявність пульта дистанційного керування робить експлуатацію ще простішою. Стильний дизайн світильника легко впишеться в будь-який інтер'єр. Це ідеальне поєднання функціональності, стилю і сучасних  технологій, яке стане справжньою окрасою вашого будинку.";

export const imagesForSliderCosmos = [
	cosmos1,
	cosmos2,
	cosmos3,
	cosmos4,
	cosmos5,
	cosmos6,
	cosmos7,
	cosmos8,
];

export const detailsForCosmos = [
	{
		title: "Ефект зоряного неба і туманності",
		descr: "",
	},
	{
		title: "Зміна напрямку проекції",
		descr: "",
	},
	{
		title: "Регулювання яскравості туманності",
		descr: "",
	},
	{
		title: "Регулювання швидкості зміни туманност",
		descr: "",
	},
	{
		title: "Перемикання кольору туманності",
		descr: "",
	},
	{
		title: "Керування зірками (ввімкнути/вимкнути)",
		descr: "",
	},
	{
		title: "Регулювання яскравості зірок",
		descr: "",
	},
	{
		title: "Можливість встановити таймер: ",
		descr: "45 / 90 хв",
	},
	{
		title: "Пульт дистанційного керування",
		descr: "",
	},
	{
		title: "Кнопки управління",
		descr: "",
	},
	{
		title: "Живлення: ",
		descr: "від USB",
	},
	{
		title: "Розмір: ",
		descr: "85*76*125 мм",
	},
];

export const equipmentForCosmos = [
	"Світильник проектор",
	"Двосторонній скотч",
	"Пульт дистанційного керування",
	"USB кабель",
	"Інструкція",
];

export const reviewsForCosmos = [
	{
		name: "Богдан В.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user1,
		text: "Купили цей проектор для спальні, і тепер кожен вечір у нас — справжнє зоряне шоу. Дуже подобається, що можна регулювати яскравість туманності та швидкість зміни кольорів — це створює неповторну атмосферу. Дистанційний пульт працює на відмінно, зручно управляти, навіть не підходячи до проектора. Дітям також дуже подобається, особливо можливість вмикати і вимикати зірки. Рекомендую всім!",
	},
	{
		name: "Світлана Г.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user2,
		text: "Проектор просто супер! Компактний, живиться від USB, тому легко використовувати і вдома, і в дорозі. Ефект зоряного неба виглядає дуже реалістично, туманність змінює кольори і створює заспокійливий настрій. Таймер на 45 або 90 хвилин — це зручна функція, особливо коли хочеться засинати під зоряний купол. Дистанційне керування теж працює бездоганно. Дійсно вартий своєї ціни!",
	},
	{
		name: "Олена А.",
		star: "⭐️⭐️⭐️⭐️⭐️",
		img: user3,
		text: "Дуже задоволена цим проектором, він реально створює ефект космосу у кімнаті. Легко можна змінювати колір туманності, налаштовувати яскравість і навіть вимикати зірки, коли хочеться більш спокійного світла. Пульт допомагає швидко налаштувати все, а таймер дозволяє залишити його ввімкненим, не переживаючи, що працюватиме всю ніч. Розмір зручний, не займає багато місця. Рекомендую як дорослим, так і дітям!",
	},
];
