import knife1 from "./helpers/images/knife-prod/1.jpg";
import knife2 from "./helpers/images/knife-prod/2.jpg";
import knife3 from "./helpers/images/knife-prod/3.jpg";
import knife4 from "./helpers/images/knife-prod/4.jpg";
import knife5 from "./helpers/images/knife-prod/5.jpg";
import knife6 from "./helpers/images/knife-prod/6.jpg";
import knife7 from "./helpers/images/knife-prod/7.jpg";
import knife8 from "./helpers/images/knife-prod/8.jpg";

import lamp1 from "./helpers/images/slider-lamp/1.jpg";
import lamp2 from "./helpers/images/slider-lamp/2.jpg";
import lamp3 from "./helpers/images/slider-lamp/3.jpg";
import lamp4 from "./helpers/images/slider-lamp/4.jpg";
import lamp5 from "./helpers/images/slider-lamp/5.jpg";
import lamp6 from "./helpers/images/slider-lamp/6.jpg";
import lamp7 from "./helpers/images/slider-lamp/7.jpg";
import lamp8 from "./helpers/images/slider-lamp/8.jpg";

import rubber1 from "./helpers/images/rubber-prod/1.jpg";
import rubber2 from "./helpers/images/rubber-prod/2.jpg";
import rubber3 from "./helpers/images/rubber-prod/3.jpg";
import rubber4 from "./helpers/images/rubber-prod/4.jpg";
import rubber5 from "./helpers/images/rubber-prod/5.jpg";
import rubber6 from "./helpers/images/rubber-prod/6.jpg";
import rubber7 from "./helpers/images/rubber-prod/7.jpg";
import rubber8 from "./helpers/images/rubber-prod/8.jpg";
import rubber9 from "./helpers/images/rubber-prod/9.jpg";
import rubber10 from "./helpers/images/rubber-prod/10.jpg";

import goose1 from "./helpers/images/goose-prod/1.jpg";
import goose2 from "./helpers/images/goose-prod/2.jpg";
import goose3 from "./helpers/images/goose-prod/3.jpg";
import goose4 from "./helpers/images/goose-prod/4.jpg";
import goose5 from "./helpers/images/goose-prod/5.jpg";
import goose6 from "./helpers/images/goose-prod/6.jpg";
import goose7 from "./helpers/images/goose-prod/7.jpg";

import color1 from "./helpers/images/color-prod/1.jpg";
import color2 from "./helpers/images/color-prod/2.jpg";
import color3 from "./helpers/images/color-prod/3.jpg";
import color4 from "./helpers/images/color-prod/4.jpg";
import color5 from "./helpers/images/color-prod/5.jpg";
import color6 from "./helpers/images/color-prod/6.jpg";
import color7 from "./helpers/images/color-prod/7.jpg";
import color8 from "./helpers/images/color-prod/8.jpg";
import color9 from "./helpers/images/color-prod/9.jpg";
import color10 from "./helpers/images/color-prod/10.jpg";

export const ratingStars = [
	{
		star: "1",
		class: "star",
	},
	{
		star: "2",
		class: "star",
	},
	{
		star: "3",
		class: "star",
	},
	{
		star: "4",
		class: "star",
	},
	{
		star: "5",
		class: "star",
	},
];

// export const sizeForGlobe = [
// 	{
// 		sm: 12,
// 		old: 840,
// 		new: 645,
// 	},
// 	{
// 		sm: 15,
// 		old: 980,
// 		new: 755,
// 	},
// 	{
// 		sm: 18,
// 		old: 1250,
// 		new: 975,
// 	},
// ];

// ============================================== LAMP

export const sizeForLamp = null;

export const prodTitle = "Акумуляторна лампа для кемпінгу CG-30W 3000mAh";

export const nameProd = "Battery Lamp";

export const cost = {
	old: 690,
	new: 379,
};

export const infoProd =
	"Для аварійного освітлення у квартирі чи офісі максимально наближає до звичайного повсякденного освітлення. Наявність трьох режимів освітлення допоможе підібрати найбільш комфортне світло для ваших умов. Повного заряду акумулятора вистачає приблизно на 4-6 годин безперервної роботи. Після чого ви завжди можете підключити павербанк. Заряджається від кабелю USB, що йде в комплекті. Можна заряджати через розетку, ноутбук, павербанк та сонячну панель.";

export const imagesForLampSlider = [
	lamp1,
	lamp2,
	lamp3,
	lamp4,
	lamp5,
	lamp6,
	lamp7,
	lamp8,
];

export const detailsTitle = "Характеристики";

export const detailsForLamp = [
	{
		title: "Місткість акумулятора:",
		descr: "3000 mAh",
	},
	{
		title: "Час роботи:",
		descr: "від 6 до 8 годин",
	},
	{
		title: "Час зарядки:",
		descr: "6 годин",
	},
	{
		title: "Колір:",
		descr: "білий",
	},
	{
		title: "Кількість режимів:",
		descr: "3 (яскраве, м'яке, миготіння)",
	},
];

export const equipmentForLamp = ["Крючок", "Кабель живлення USB", "Лампа"];

export const equipmentTitleForLamp = "Комплектація";

export const reviewsForLampNew = [
	{
		rating: "5",
		name: "Галя",
		text: "Сподобалось. Дякую хлопчику менеджеру за його терпіння 😂",
	},
	{
		rating: "5",
		name: "Тетяна",
		text: "Замовили одразу 4, нарікань не маю, добре світить",
	},
	{
		rating: "5",
		name: "Володимир",
		text: "За ці бабки - пушка",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "Замовила ввечері, а мені відразу зателефонували, оце я розумію сервіс ❤️💋",
	},
	{
		rating: "5",
		name: "Оля",
		text: "",
	},
	{
		rating: "5",
		name: "Олексій",
		text: "Швидко.Якісно.Спасибі.",
	},
	{
		rating: "5",
		name: "Катерина",
		text: "👌🏻👌🏻👌🏻",
	},
];

//========================================================================= KNIFE

export const sizeForKnife = null;

export const prodTitleKnife =
	"Електрична точила для заточування ножів та ножиць ELECTRIC SHARPENER 220В";

export const costKnife = {
	old: 750,
	new: 450,
};

export const infoKnife =
	"Наточити ніж за допомогою точилки для ножів під силу навіть жінці! Добре заточений ніж на кухні – мрія кожної господині чи мисливця. Заточення ножів справа складна та трудомістка. Необхідно знати, як правильно точити ніж та мати досвід. Точилка для ножів виконує заточування інструменту протягом декількох секунд. Перевагою даної точилки є можливість заточування ножів із зубчастим лезом та заточування ножиць. Для того щоб Ваш ніж знову був гострий, потрібно лише провести кілька разів лезом ножа взад-вперед спеціальним роз’ємом на корпусі точила. Те саме потрібно зробити для ножиць і викруток з вузькою та широкою основою. Прилад для заточування інструментів виготовлений із високоякісного матеріалу, що гарантує його довговічність у використанні.";

export const imagesForKnifeSlider = [
	knife1,
	knife2,
	knife3,
	knife4,
	knife5,
	knife6,
	knife7,
	knife8,
];

export const detailsTitleKnife = "Переваги";

export const detailsForKnife = [
	{
		title: "пластиковий корпус",
		descr: "",
	},
	{
		title: "металеві елементи для заточування",
		descr: "",
	},
	{
		title: "працює від 220 В",
		descr: "",
	},
	{
		title: "потужність 50 Гц, 20 Вт",
		descr: "",
	},
	{
		title:
			"роз’єм для заточування ножів, ножиць, викруток з вузькою та широкою основою",
		descr: "",
	},
	{
		title: "розмір 15 х 9 х 6 см",
		descr: "",
	},
];

export const equipmentForKnife = [];

export const equipmentTitleForKnife = "Комплектація";

export const reviewsForKnife = [
	{
		rating: "5",
		name: "Антоніна",
		text: "Точе добре",
	},
	{
		rating: "5",
		name: "Олеся",
		text: "Гарна якість. Швидка доставка.",
	},
	{
		rating: "5",
		name: "Семен",
		text: "",
	},
	{
		rating: "5",
		name: "Аліна",
		text: "",
	},
	{
		rating: "5",
		name: "Олена",
		text: "Все сподобалось, гарна річ за таку смішну ціну",
	},
	{
		rating: "5",
		name: "Микола",
		text: "Ніж тепер страшно в руки брати гострий😁 Круто, спс",
	},
	{
		rating: "5",
		name: "Магдалина",
		text: "Покупкою задоволена.",
	},
];

//========================================================================= RUBBER

export const sizeForRubber = null;

export const prodTitleRubber =
	"Гумка для фітнесу та тренувань Fit Simplify GO DO 5 шт";

export const costRubber = {
	old: 650,
	new: 350,
};

export const infoRubber =
	"Фітнес гумки – компактний універсальний тренажер, що дозволяє швидко організувати тренування в домашніх умовах або надати навантаження на важкодоступну групу м’язів. Застосовується для фітнесу, йоги та пілатесу. З успіхом використовується в реабілітації після травм та хвороб, що викликали атрофію м’язів. Використовувати цей тренажер можуть як діти, так і дорослі будь-якого рівня спортивної підготовки.";

export const imagesForRubberSlider = [
	rubber2,
	rubber10,
	rubber1,
	rubber5,
	rubber3,
	rubber4,
	rubber6,
	rubber7,
	rubber8,
	rubber9,
];

export const detailsTitleRubber = "Опис";

export const detailsForRubber = [
	{
		title: "X-light (екстра легка) ",
		descr: "колір зелений, навантаження 3,5кг, товщина 0,35мм",
	},
	{
		title: "Light (легка) ",
		descr: "колір блакитний, навантаження 8 кг, товщина 0,5 мм.",
	},
	{
		title: "Medium (середня) ",
		descr: "колір жовтий, навантаження 14 кг, товщина 0,7 мм.",
	},
	{
		title: "Heavy (важка) ",
		descr: "колір червоний, навантаження 18 кг, товщина 0,9 мм.",
	},
	{
		title: "X-heavy (екстра важка) ",
		descr: "колір чорний, навантаження 22 кг, товщина 1,1 мм.",
	},
];

export const equipmentForRubber = [
	"У лінійку тренажерів Latex Bend «Fit Simplify» входять 5 гумок різного рівня опору, від надлегкого до надважкого навантаження:",
	"Кожна з фітнес гумок Fit Simplify є еластичною стрічкою виготовленою зі 100% натурального латексу.",
	"Якість матеріалу та його міцність забезпечує необмежений термін служби гумок.",
];

export const equipmentTitleForRubber = "Детальніше";

export const reviewsForRubber = [
	{
		rating: "5",
		name: "Настя",
		text: "😍😍😍",
	},
	{
		rating: "5",
		name: "Катерина",
		text: "Буває не встигаю в зал, займаюсь вдома, резинки просто шик 😘💋",
	},
	{
		rating: "5",
		name: "Мирослава",
		text: "Менеджеру окремо дякую, дуже приємний, резинки міцні та якісні",
	},
	{
		rating: "5",
		name: "Андрій",
		text: "Купив 4 комплекти в зал, дуже гарна якість",
	},
	{
		rating: "5",
		name: "Оля",
		text: "Поки дитина спить я можу займатись своєю фігурою. Спасибі, якісно",
	},
	{
		rating: "5",
		name: "Світлана",
		text: "",
	},
	{
		rating: "5",
		name: "Валерія",
		text: "ТОП !!!!",
	},
];

//========================================================================= GOOSE

export const sizeForGoose = null;

export const prodTitleGoose =
	"Гігантська м'яка плюшева іграшка Гусь-обіймусь 110 см";

export const costGoose = {
	old: 975,
	new: 599,
};

export const infoGoose =
	"Дуже м’яка і мила іграшка-антистрес. Можна використовувати як подушку, ще з нею дуже приємно обійматись! Відмінний подарунок як для дорослого, так і для дитини. Море позитивних емоцій буде забезпечено надовго!";

export const imagesForGooseSlider = [
	goose1,
	goose2,
	goose3,
	goose4,
	goose5,
	goose6,
	goose7,
];

export const detailsTitleGoose = "Переваги";

export const detailsForGoose = [
	{
		title: "Великого розміру",
		descr: "110см",
	},
	{
		title:
			"Іграшка зроблена з приємного, еластичного, екологічно чистого плюшу, не токсичного та гіпоалергенного;",
		descr: "",
	},
	{
		title: "Наповнювач",
		descr: "холофайбер",
	},
	{
		title: "Не має дрібних деталей, тому підходить навіть маленьким діткам",
		descr: "",
	},
	{
		title: "Можна використовувати як подушку",
		descr: "",
	},
	{
		title: "Приємний на дотик",
		descr: "",
	},
	{
		title:
			"Ззаду іграшки є невелика таємна блискавка, завдяки якій можна вийняти наповнювач для зручності прання",
		descr: "",
	},
];

export const equipmentForGoose = [];

export const equipmentTitleForGoose = "";

export const reviewsForGoose = [
	{
		rating: "5",
		name: "Ксенія",
		text: "Дитина в захваті",
	},
	{
		rating: "5",
		name: "Тетяна",
		text: "Взяла для себе і чоловіка, обидва задоволені) Дякую👍🏻",
	},
	{
		rating: "5",
		name: "Мирослава",
		text: "",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "❤️❤️❤️❤️❤️",
	},
	{
		rating: "5",
		name: "Аріна",
		text: "Який же на дотик приємний 😍😍😍",
	},
];
//========================================================================= COLOR

export const prodTitleColor =
	"Набір маркерів для малювання Touch від 24 до 168 шт./уп. двосторонні професійні фломастери для художників";

export const costColor = {
	old: 375,
	new: 250,
};

export const infoColor =
	"Спиртові маркери Touch для тих, хто захоплений малюванням та каліграфією, любить створювати комікси та мальовничі ескізи. У наборі від 24 до 168 маркерів різних кольорів. Корпус пластиковий гладкий. Ковпачки щільно закриваються. Для зручності розпізнавання типу пера кінці маркерів пофарбовані різним кольором. Кожен колір має свій цифровий код, який нанесений на ковпачок маркера. Чорнила на спиртовій основі добре вбираються в папір, тому рекомендується використовувати щільні листи або картон. ; Кольори добре змішуються між собою, перехід відтінків плавний. Довжина маркера 15,5 див.";

export const imagesForColorSlider = [
	color3,
	color2,
	color8,
	color5,
	color1,
	color4,
	color6,
	color7,
	color9,
	color10,
];

export const detailsTitleColor = "Характеристики ";

export const detailsForColor = [
	{
		title: "Тип: ",
		descr: "Маркер",
	},
	{
		title: "Маркер двосторонній",
		descr: "",
	},
	{
		title: "Гострий наконечник",
		descr: "",
	},
	{
		title: "Плоский наконечник",
		descr: "",
	},
	{
		title: "Основа чорнила:",
		descr: "спиртова",
	},
	{
		title: "Колір: ",
		descr: "різні кольори",
	},
	{
		title: "Кількість в упаковці:",
		descr: "від 24 до 168 (шт.)",
	},
];

export const equipmentForColor = [
	"Маркери: від 24 до 168 шт",
	"Сумка-чохол для маркерів",
];

export const equipmentTitleForColor = "Комплектація";

export const reviewsForColor = [
	{
		rating: "5",
		name: "Олена",
		text: "Дитина в захваті",
	},
	{
		rating: "5",
		name: "Світлана",
		text: "Дякую👍🏻 брали на подарунок, дуже задоволені",
	},
	{
		rating: "5",
		name: "Карина",
		text: "❤️",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "Вааааау, дуже гарна якість😍😍😍",
	},
	{
		rating: "5",
		name: "Асмік",
		text: "Швидка доставка, оглянула на пошті, оплатила, одним словом - рекомендую.",
	},
	{
		rating: "5",
		name: "Дмитро",
		text: "Купив донечці, швидко, якісно !",
	},
	{
		rating: "5",
		name: "Артем",
		text: "Як для подарунку топ",
	},
];

export const sizeForColor = [
	{
		sm: "24 маркера",
		old: 375,
		new: 250,
	},
	{
		sm: "36 маркерів",
		old: 425,
		new: 310,
	},
	{
		sm: "48 маркерів",
		old: 550,
		new: 410,
	},
	{
		sm: "80 маркерів",
		old: 750,
		new: 520,
	},
	{
		sm: "120 маркерів",
		old: 975,
		new: 749,
	},
	{
		sm: "168 маркерів",
		old: 1150,
		new: 975,
	},
];

export const marqueeColor = "ВСТИГНИ ПРИДБАТИ НАБІР ЗІ ЗНИЖКОЮ ВІД ";
