export const ratingStars = [
	{
		star: "1",
		class: "star",
	},
	{
		star: "2",
		class: "star",
	},
	{
		star: "3",
		class: "star",
	},
	{
		star: "4",
		class: "star",
	},
	{
		star: "5",
		class: "star",
	},
];

export const reviewsForLampNew = [
	{
		rating: "5",
		name: "Галя",
		text: "Сподобалось. Дякую хлопчику менеджеру за його терпіння 😂",
	},
	{
		rating: "5",
		name: "Тетяна",
		text: "Замовили одразу 4, нарікань не маю, добре світить",
	},
	{
		rating: "5",
		name: "Володимир",
		text: "За ці бабки - пушка",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "Замовила ввечері, а мені відразу зателефонували, оце я розумію сервіс ❤️💋",
	},
	{
		rating: "5",
		name: "Оля",
		text: "",
	},
	{
		rating: "5",
		name: "Олексій",
		text: "Швидко.Якісно.Спасибі.",
	},
	{
		rating: "5",
		name: "Катерина",
		text: "👌🏻👌🏻👌🏻",
	},
];

//========================================================================= KNIFE

export const reviewsForKnife = [
	{
		rating: "5",
		name: "Антоніна",
		text: "Точе добре",
	},
	{
		rating: "5",
		name: "Олеся",
		text: "Гарна якість. Швидка доставка.",
	},
	{
		rating: "5",
		name: "Семен",
		text: "",
	},
	{
		rating: "5",
		name: "Аліна",
		text: "",
	},
	{
		rating: "5",
		name: "Олена",
		text: "Все сподобалось, гарна річ за таку смішну ціну",
	},
	{
		rating: "5",
		name: "Микола",
		text: "Ніж тепер страшно в руки брати гострий😁 Круто, спс",
	},
	{
		rating: "5",
		name: "Магдалина",
		text: "Покупкою задоволена.",
	},
];

export const reviewsForRubber = [
	{
		rating: "5",
		name: "Настя",
		text: "😍😍😍",
	},
	{
		rating: "5",
		name: "Катерина",
		text: "Буває не встигаю в зал, займаюсь вдома, резинки просто шик 😘💋",
	},
	{
		rating: "5",
		name: "Мирослава",
		text: "Менеджеру окремо дякую, дуже приємний, резинки міцні та якісні",
	},
	{
		rating: "5",
		name: "Андрій",
		text: "Купив 4 комплекти в зал, дуже гарна якість",
	},
	{
		rating: "5",
		name: "Оля",
		text: "Поки дитина спить я можу займатись своєю фігурою. Спасибі, якісно",
	},
	{
		rating: "5",
		name: "Світлана",
		text: "",
	},
	{
		rating: "5",
		name: "Валерія",
		text: "ТОП !!!!",
	},
];

//========================================================================= GOOSE

export const reviewsForGoose = [
	{
		rating: "5",
		name: "Ксенія",
		text: "Дитина в захваті",
	},
	{
		rating: "5",
		name: "Тетяна",
		text: "Взяла для себе і чоловіка, обидва задоволені) Дякую👍🏻",
	},
	{
		rating: "5",
		name: "Мирослава",
		text: "",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "❤️❤️❤️❤️❤️",
	},
	{
		rating: "5",
		name: "Аріна",
		text: "Який же на дотик приємний 😍😍😍",
	},
];

export const reviewsForColor = [
	{
		rating: "5",
		name: "Олена",
		text: "Дитина в захваті",
	},
	{
		rating: "5",
		name: "Світлана",
		text: "Дякую👍🏻 брали на подарунок, дуже задоволені",
	},
	{
		rating: "5",
		name: "Карина",
		text: "❤️",
	},
	{
		rating: "5",
		name: "Поліна",
		text: "Вааааау, дуже гарна якість😍😍😍",
	},
	{
		rating: "5",
		name: "Асмік",
		text: "Швидка доставка, оглянула на пошті, оплатила, одним словом - рекомендую.",
	},
	{
		rating: "5",
		name: "Дмитро",
		text: "Купив донечці, швидко, якісно !",
	},
	{
		rating: "5",
		name: "Артем",
		text: "Як для подарунку топ",
	},
];

export const reviewsForHoodie = [
	{
		rating: "5",
		name: "Віта",
		text: "Дужеее теплий, рекомендую😍😍😍",
	},
	{
		rating: "5",
		name: "Світлана",
		text: "Купила дітям, все чудово, дякую !",
	},
	{
		rating: "5",
		name: "Аліна",
		text: "Саме те що треба, зігріває та приємний на дотик 😘💋",
	},
	{
		rating: "5",
		name: "Єва",
		text: "Замовила собі і чоловіку, тепер ми як два ведмедика) клас, рекомендую 👍🏻",
	},
	{
		rating: "5",
		name: "Сніжана",
		text: "Дякую",
	},
];

export const marqueeHoodie = "ВСТИГНИ ПРИДБАТИ НАБІР ЗІ ЗНИЖКОЮ ВІД ";
