//Juice 
import promoFlower from "./helpers/images/flowers/11.png";
import firstFlower from "./helpers/images/flowers/5.jpg";
import secondFlower from "./helpers/images/flowers/6.jpg";
import thirdFlower from "./helpers/images/flowers/1.jpg";
import fourthFlower from "./helpers/images/flowers/4.jpg";

// lamp
import l1 from "./helpers/images/thanks/lamp/l1.jpg";
import l2 from "./helpers/images/thanks/lamp/l2.jpg";
import l3 from "./helpers/images/thanks/lamp/l3.jpg";
import l4 from "./helpers/images/thanks/lamp/l4.jpg";
import l5 from "./helpers/images/thanks/lamp/l5.jpg";
import l6 from "./helpers/images/thanks/lamp/l6.jpg";

// flower lilia
import li1 from "./helpers/images/thanks/lilia/li1.jpg";
import li2 from "./helpers/images/thanks/lilia/li2.png";
import li3 from "./helpers/images/thanks/lilia/li3.png";
import li4 from "./helpers/images/thanks/lilia/li4.png";
import li5 from "./helpers/images/thanks/lilia/li5.png";

// flower troyanda
import t1 from "./helpers/images/thanks/troyanda/t1.jpg";
import t2 from "./helpers/images/thanks/troyanda/t2.jpg";
import t3 from "./helpers/images/thanks/troyanda/t3.jpg";
import t6 from "./helpers/images/thanks/troyanda/t6.jpg";
import tk1 from "./helpers/images/thanks/troyanda/tk1.jpg";
import tk2 from "./helpers/images/thanks/troyanda/tk2.jpg";
import tk3 from "./helpers/images/thanks/troyanda/tk3.jpg";

// bottle
import b1 from "./helpers/images/thanks/bottle/b1.jpg";
import b2 from "./helpers/images/thanks/bottle/b2.jpg";
import b3 from "./helpers/images/thanks/bottle/b3.jpg";
import b4 from "./helpers/images/thanks/bottle/b4.jpg";
import b5 from "./helpers/images/thanks/bottle/b5.jpg";
import b6 from "./helpers/images/thanks/bottle/b6.jpg";
import b7 from "./helpers/images/thanks/bottle/b7.jpg";
import b8 from "./helpers/images/thanks/bottle/b8.jpg";
import b9 from "./helpers/images/thanks/bottle/b9.jpg";

import kkk1 from "./helpers/images/thanks/lilia/kkk1.png"
import kkk2 from "./helpers/images/thanks/lilia/kkk2.png"
import kkk3 from "./helpers/images/thanks/lilia/kkk3.png"
import kkk4 from "./helpers/images/thanks/lilia/kkk4.png"
import kkk5 from "./helpers/images/thanks/lilia/kkk5.png"


export const thanksPageForFlower = [
    {
        id: 10,
        images: [kkk1, kkk2, kkk3],
        title: "Лінивий кавун",
        old: "220",
        new: "129",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "1 + 1 = 3",
        details: [
            {
                t: "Термін дозрівання:",
                d: "75 - 85 днів"
            },
            {
                t: "Вага плоду:",
                d: "3 - 5 кг"
            },
            {
                t: "Смакові якості:",
                d: "Солодкий, ніжний, соковитий"
            },
            {
                t: "Особливості:",
                d: "Добре росте навіть за мінімального догляду"
            },
            {
                t: "Посів у ґрунт:",
                d: "Квітень - травень"
            },
            {
                t: "Умови вирощування:",
                d: "Сонячні ділянки, піщаний або суглинковий ґрунт"
            }
        ],
    },
    {
        id: 11,
        images: [kkk4, kkk5],
        title: "Бебі-Диня",
        old: "195",
        new: "99",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "1 + 1 = 3",
        details: [
            {
                t: "Термін дозрівання:",
                d: "65 - 75 днів"
            },
            {
                t: "Вага плоду:",
                d: "1 - 2 кг"
            },
            {
                t: "Смакові якості:",
                d: "Дуже солодка, ароматна, соковита"
            },
            {
                t: "Застосування:",
                d: "Для свіжого вживання, салатів, десертів"
            },
            {
                t: "Посів у ґрунт:",
                d: "Квітень - травень"
            },
            {
                t: "Умови вирощування:",
                d: "Сонячні ділянки, легкий дренований ґрунт"
            }
        ],
    },
    {
        id: 3,
        images: [tk1, tk2, tk3],
        title: "Троянда кущова (25 г.)",
        old: "250",
        new: "150",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "1 + 1 = 3",
        details: [
            {
                t: "Вага насіння:",
                d: "25 г."
            },
            {
                t: "Глубина посадки:",
                d: "10 см"
            },
            {
                t: "Відстань:",
                d: "40 см"
            },
            {
                t: "Колір плоду:",
                d: "Рожевий"
            },
            {
                t: "Виробник:",
                d: "Україна"
            },
            {
                t: "Підходить на зріз:",
                d: "Так"
            },
            {
                t: "Початок посадки:",
                d: "березень"
            },
            {
                t: "Кінець посадки:",
                d: "грудень"
            },
            {
                t: "Період квітнення:",
                d: "червень-жовтень"
            },
        ],
    },
    {
        id: 4,
        images: [b1, b2, b3],
        title: "Біопрепарат-інсектицид для захисту овочів та саду від шкідників",
        old: "240",
        new: "170",
        saleMessage: "Встигни придбати за акційною ціною",
        percent: "-30%",
        details: [
            {
                t: "Виробник:",
                d: "Україна"
            },
            {
                t: "Характер дії пестициду:",
                d: "Суцільний"
            },
            {
                t: "Хімічний склад:",
                d: "Неорганічні"
            },
            {
                t: "Період перших ознак дії: ",
                d: "1 - 3 дні."
            },
            {
                t: "Усунення шкідників настає через: ",
                d: "3 - 7 днів."
            },
            {
                t: "Тривалість захисної дії, в середньому: ",
                d: "14 днів"
            },
            {
                t: "Діюча речовина:",
                d: "Біологічно активні продукти"
            },
            {
                t: "Препаративна форма:",
                d: "Концентрат емульсії"
            },
        ],
    },
    {
        id: 5,
        images: [b4, b5, b6],
        title: "Засіб від бур'янів Tolimo",
        old: "240",
        new: "170",
        saleMessage: "Встигни придбати за акційною ціною",
        percent: "-30%",
        details: [
            {
                t: "Препаративна форма:",
                d: "Концентрат суспензії"
            },
            {
                t: "Хімічний склад:",
                d: "Органічний"
            },
            {
                t: "Склад:",
                d: "Триосновні карбонові кислоти, магній, хлорид натрію, кальцій, азот"
            },

        ],
    },
    {
        id: 6,
        images: [b7, b8, b9],
        title: "Антаут - захист від різних видів мурах",
        old: "220",
        new: "120",
        saleMessage: "Встигни придбати за акційною ціною",
        percent: "-46%",
        details: [
            {
                t: "Повне знищення колонії мурах:",
                d: "5 - 7 днів"
            },
            {
                t: "Повторне застосування:",
                d: "10 - 15 днів"
            },
            {
                t: "Для тварин та людей:",
                d: "безпечний"
            },
            {
                t: "Застосовувати:",
                d: "у місцях скупчення мурашок"
            },
            {
                t: "Пропорція:",
                d: "40 г на 40 м2"
            },
        ],
    },
   
    
]



// Barbecue
import m11 from "./helpers/images/barbecue/m11.png";
import m12 from "./helpers/images/barbecue/m12.png";
import m13 from "./helpers/images/barbecue/m13.png";
import m14 from "./helpers/images/barbecue/m14.png";
import m18 from "./helpers/images/barbecue/m18.png";
import m17 from "./helpers/images/barbecue/m17.png";
//thanks
import md1 from "./helpers/images/thanks/bbq/md1.jpg";
import md2 from "./helpers/images/thanks/bbq/md2.png";
import md3 from "./helpers/images/thanks/bbq/md3.jpg";
import md4 from "./helpers/images/thanks/bbq/md4.jpg";
import md5 from "./helpers/images/thanks/bbq/md5.png";
import md7 from "./helpers/images/thanks/bbq/md7.png";
import md8 from "./helpers/images/thanks/bbq/md8.png";
import md11 from "./helpers/images/thanks/bbq/md11.png";
import md12 from "./helpers/images/thanks/bbq/md12.png";
import md13 from "./helpers/images/thanks/bbq/md13.png";
import md14 from "./helpers/images/thanks/bbq/md14.png";
import md15 from "./helpers/images/thanks/bbq/md15.png";
import md16 from "./helpers/images/thanks/bbq/md16.png";
import md17 from "./helpers/images/thanks/bbq/md17.png";
import md18 from "./helpers/images/thanks/bbq/md18.png";


export const thanksPageForBarbecue = [
    {
        id: 4,
        images: [md1, md2, md3, md4],
        title: "Пристрій для швидкого нанизування шашлику",
        old: "550",
        new: "299",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-46%",
        details: [
            {
                t: "Матеріал:",
                d: "пластик"
            },
            {
                t: "Розміри:",
                d: "11 х 11 х 24 см"
            },
            {
                t: "У комплекті:",
                d: "30 загострених бамбукових паличок, 26 см"
            },
            {
                t: "Вага:",
                d: "600 г."
            },
        ],
    },
    {
        id: 7,
        images: [md16, md15, md14],
        title: "Набір ножів Non-Stick Coating Knife Set",
        old: "599",
        new: "325",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-46%",
        details: [
            {
                t: "Тип:",
                d: "Набір ножів 6 в 1"
            },
            {
                t: "Матеріал:",
                d: "нержавіюча сталь, бакеліт"
            },
            {
                t: "Колір:",
                d: "блискучий чорний"
            },
            {
                t: "Вага:",
                d: "1 кг"
            },
            {
                t: "Коробка розмір:",
                d: "36 x 23 x 3 см"
            },
            {
                t: "Матеріал:",
                d: "пластик (поліоксиметилен) з нержавіючої сталі"
            },
        ],
    },
    {
        id: 6,
        images: [md11, md12, md13],
        title: "Підвісний гамак з москітною сіткою HIeha ",
        old: "880",
        new: "499",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-44%",
        details: [
            {
                t: "Матеріал:",
                d: "нейлон"
            },
            {
                t: "Розмір у розкладеному вигляді:",
                d: "263х135 см"
            },
            {
                t: "Розмір у складеному вигляді:",
                d: "29х20 см"
            },
            {
                t: "Вага:",
                d: "200 кг"
            },
            {
                t: "Особливості:",
                d: "Москітна сітка з одного боку пришита"
            },
        ],
    },
    {
        id: 8,
        images: [md17, md18],
        title: "Табурет складаний м'який 1 шт",
        old: "750",
        new: "499",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-46%",
        details: [
            {
                t: "Покриття сидіння:",
                d: "міцна екошкіра"
            },
            {
                t: "Вага:",
                d: "2.4 кг"
            },
            {
                t: "Колір:",
                d: "чорний"
            },
            {
                t: "Зручність:",
                d: "швидко складається, займає мало місця"
            },
        ],
    },
    {
        id: 5,
        images: [md5, md7, md8],
        title: "Набір для барбекю та гриль. 8 предметів.",
        old: "970",
        new: "799",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-18%",
        details: [
            {
                t: "Товщина металу:",
                d: "1,6 мм"
            },
            {
                t: "Щипці:",
                d: "41х5см"
            },
            {
                t: "Лопатка:",
                d: "40.5х9см"
            },
            {
                t: "Ніж:",
                d: "33х2.8см"
            },
            {
                t: "Виделка:",
                d: "42х3см"
            },
            {
                t: "Шампура 4 шт:",
                d: "39.5х0.5см"
            },
            {
                t: "Сумка-чохол: ",
                d: "45х13.5х5см"
            },
        ],
    },
]


export const pageConfig = {
    title: 'Фітнес тренажер для преса і віджимань',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Фітнес тренажер для преса і віджимань"
        },
        {
            "type": "promoBlock",
            "src": promoFlower,
            "oldPrice": "1100 грн",
            "newPrice": "799 грн",
        },

        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "descriptionBlock",
            "title": "Ти коли-небудь мріяв про кубики пресу ?",
            "subtitle": `
                Цей компактний і легкий тренажер включає в себе три ключові елементи: дошку для планки, 
                платформу для віджимань та трубчастий еспандер. Поєднуючи ці елементи, тренажер пропонує 
                повноцінне тренування, яке охоплює не тільки м'язи пресу, а й руки, ноги, грудні м'язи, сідниці та спину.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": promoFlower
                },
                {
                    "type": "text",
                    "boldType": "Дошка для планки:",
                    "descr": `
                        М'які підлокітники та нековзні ручки забезпечують комфорт та зручність під час виконання вправ. 
                        Вбудований таймер та місце для телефону дозволяють відстежувати час тренування та звільняють від необхідності контролювати час.
                    `
                },
                {
                    "type": "text",
                    "boldType": "Платформа для віджимань: ",
                    "descr": `
                        Сім різних положень для регулювання кута навантаження допомагають націлювати 
                        тренування на різні групи м'язів. Вставні ручки дозволяють легко змінювати положення, збільшуючи ефективність тренувань.
                    `,
                },
                {
                    "type": "text",
                    "boldType": "Трубчастий еспандер: ",
                    "descr": `
                        Ідеальний для тренування м'язів рук і зап'ясть. 
                        Легко приєднується до основи платформи, пропонуючи різноманітні варіанти вправ.
                    `
                },
                {
                    "type": "photo",
                    "image": promoFlower
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Фітнес-тренажер для пресу LK202310-17 є ідеальним вибором для тих, хто прагне підтримувати фізичну форму та займатися спортом вдома.
                    `
                },
                {
                    "type": "photo",
                    "image": promoFlower
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Він займає мало місця, легко переміщується та зберігається, що робить його незамінним помічником 
                        у домашніх тренуваннях. На відміну від звичайного ролика для пресу, цей тренажер пропонує різноманіття 
                        вправ та можливість тренувати різні групи м'язів, роблячи кожне тренування максимально ефективним.
                    `
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Модель тренажера:",
                    "descr": "Міні тренажер; домашній; багатофункціональний"
                },
                {
                    "title": "Система навантаження:",
                    "descr": "Механічна; аеродинамічна; ремінна"
                },
                {
                    "title": "Розмір:",
                    "descr": "60 х 30 х 3 см"
                },
                {
                    "title": "Максимальна вага:",
                    "descr": "150 кг"
                },
                {
                    "title": "Матеріал:",
                    "descr": "Пластик"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Фітнес тренажер"
        },

        {
            "type": "orderBlock",
            "title": "Фітнес тренажер для преса і віджимань",
            "image": promoFlower,
            "oldPrice": "1100 грн",
            "newPrice": "799 грн",
        }
    ],
};



// JUICE PROD
export const pageConfigJuice = {
    title: 'Тюльпан Преміум-мікс (10 шт)',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Тюльпани Преміум-мікс (Преміум цибулини - 10 шт)"
        },
        {
            "type": "promoBlock",
            "src": promoFlower,
            "oldPrice": "379",
            "newPrice": "199",
        },

        {
            "type": "timerBlock",
            "text": `
                Зараз діє акційна ціна, ми хочемо подарувати вам яскраві весняні фарби за вигідною ціною! Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "sale",
            "text": "На кожну замовлену 2-гу упаковку з цибулинами тюльпану отримуй 3-ю у подарунок - ",
            "highlightedWord": "безкоштовно",
            "img": fourthFlower
        },

        {
            "type": "descriptionBlock",
            "title": "Тюльпани - це яскравий символ весни та тепла, який повинен бути у кожній оселі!",
            "subtitle": `
                Наші тюльпани – це відбірні сорти з великими бутонами та насиченими кольорами, які довго радуватимуть око.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": firstFlower
                },
                {
                    "type": "text",
                    "boldType": "Свіжість гарантована",
                    "descr": `
                        Ми дбайливо відбираємо кожну цибулину, щоб ваші квіти були здоровими, міцними та довговічними.
                        Тюльпани – це символ весни, радості та оновлення. Вони стануть чудовим сюрпризом для будь-якої нагоди.
                    `
                },
                {
                    "type": "photo",
                    "image": secondFlower
                },
                {
                    "type": "text",
                    "boldType": "Тюльпани – це",
                    "descr": `
                         одна з найбільш невибагливих весняних квіток. Вони добре ростуть як у відкритому ґрунті, так і в горщиках, 
                        не вимагаючи складного догляду. Для пишного цвітіння достатньо висадити цибулини в родючий ґрунт восени, забезпечити їм 
                        помірний полив навесні та періодично удобрювати.
                    `,
                },

                // {
                //     "type" : "advantages",
                //     "titleAdvantage": "Переваги",
                //     "listAdvantage": ["- Потужна", "- Компактна", "- Простота керування", "- Портативний", "- Свіжий сік за лічені хвилини"]
                // },

                {
                    "type": "photo",
                    "image": thirdFlower
                },

                {
                    "type": "text",
                    "boldType": "Тюльпани –",
                    "descr": `
                          чудово підходять як для прикрашання садових ділянок, так і для вирощування в домашніх умовах. 
                         У саду їх можна висаджувати групами, створюючи яскраві квіткові композиції, або комбінувати з іншими 
                         весняними рослинами – нарцисами, гіацинтами, мускарі.
                    `,
                },

                // {
                //     "type" : "use",
                //     "titleUse": "Як використовувати ?",
                //     "listUse": [
                //         "1. Натисніть і утримуйте перемикач упродовж 2 секунд для вмикання живлення і скидання, індикатор залишиться увімкненим.",
                //         "2. Покладіть фрукт у чашку (шкірою вгору)",
                //         "3. Поверніть за годинниковою стрілкою, щоб закріпити верхню кришку.",
                //         "4. Натисніть перемикач, для початку приготування соку",
                //         "5. Зачекайте, поки не закінчеться приготування соку",
                //         "6. Помістіть чашку під носик і відкрийте затвор."
                //     ]
                // },



                // {
                //     "type" : "package",
                //     "titlePackage": "Комплектація",
                //     "listPackage": ["Електрична соковичавниця", "USB-кабель", "Заводське паковання"]
                // }
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Кількість в упаковці: ",
                    "descr": "10 шт."
                },
                {
                    "title": "Глибина посадки: ",
                    "descr": "5-15 см"
                },
                {
                    "title": "Відстань: ",
                    "descr": "10 см"
                },
                {
                    "title": "Висота рослини:",
                    "descr": "40 см"
                },
                {
                    "title": "Потреба в сонці:",
                    "descr": "Сонце"
                },
                {
                    "title": "Тип продукту:",
                    "descr": "Цибулини"
                },
                {
                    "title": "Країна:",
                    "descr": "Нідерланди"
                },
                {
                    "title": "Підходить на зрізку:",
                    "descr": "Так"
                },
                {
                    "title": "Період цвітіння:",
                    "descr": "Травень"
                },
                {
                    "title": "Період посадки (старт):",
                    "descr": "Березень"
                },
                {
                    "title": "Період посадки (кінець):",
                    "descr": "Грудень"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Тюльпан Преміум-мікс (10 шт)"
        },

        {
            "type": "orderBlock",
            "title": "Тюльпани Преміум-мікс (Преміум цибулини - 10 шт)",
            "image": promoFlower,
            "oldPrice": "379",
            "newPrice": "199",
            "quantityList": [
                {
                    "value": 1,
                    "message": "1 уп. за ціною 199 грн",
                    "price": "199"
                },
                {
                    "value": 2,
                    "message": "3 уп. за ціною 2-х уп. - 398 грн.",
                    "price": "398"
                },
                {
                    "value": 4,
                    "message": "6 уп. за ціною 4-х уп. - 796 грн.",
                    "price": "796"
                },
                {
                    "value": 6,
                    "message": "9 уп. за ціною 6-х уп. - 1194 грн.",
                    "price": "1194"
                },
                {
                    "value": 7,
                    "message": "більше 10 уп. особлива акція",
                    "price": "залежить від кіл-ті"
                },
            ]
        }
    ],
};

// BERRY project (malina mao mao)
import mao1 from "./helpers/images/berry/mao1.jpg";
import mao2 from "./helpers/images/berry/mao2.jpg";
import mao3 from "./helpers/images/berry/mao3.png";
import mao4 from "./helpers/images/berry/mao4.png";
import mao5 from "./helpers/images/berry/mao5.png";
import mao6 from "./helpers/images/berry/mao6.png";
import mao7 from "./helpers/images/berry/mao7.png";

export const pageConfigBerry = {
    title: 'Насіння екзотичної малини "Мяо Мяо" (20 г.)',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Насіння екзотичної малини 'Мяо Мяо' (20 г.)"
        },
        {
            "type": "promoBlock",
            "src": mao1,
            "oldPrice": "175",
            "newPrice": "99",
        },

        {
            "type": "timerBlock",
            "text": `
                Зараз діє акційна ціна, ми хочемо подарувати Вам неповторний тибетський смак розолистої малини,
                від якої Ви точно будете в захваті, за вигідною ціною! Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "sale",
            "text": "На кожну замовлену 2-гу упаковку з насінням 'Мяо Мяо' отримуй 3-ю у подарунок - ",
            "highlightedWord": "безкоштовно",
            "img": mao7
        },

        {
            "type": "descriptionBlock",
            "title": "Малина 'Мяо-Мяо' - ",
            "subtitle": `
                також відома як тибетська або розолиста малина, є екзотичним сортом, що поєднує в собі риси 
                малини та суниці. Ця рослина формує компактні кущі висотою від 30 до 70 см, які швидко розростаються та мають густе облиствлення.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": mao3
                },
                {
                    "type": "text",
                    "boldType": "Малина 'Мяо-Мяо' - ",
                    "descr": `
                        має доволі великі плоди малиново-червоного кольору, масою 12-14 г, за формою нагадують суницю, з оригінальним кисло-солодким смаком. 
                        Цвітіння триває з липня до вересня, а плодоношення починається з липня і може тривати до пізньої осені.
                    `
                },
                {
                    "type": "photo",
                    "image": mao4
                },
                {
                    "type": "text",
                    "boldType": "Рослина невибаглива до ґрунтів ",
                    "descr": `
                        морозостійка (витримує до -35°C) та стійка до хвороб. Завдяки декоративному вигляду та тривалому періоду плодоношення, "Мяо-Мяо" 
                        підходить як для отримання смачних ягід, так і для прикраси саду.
                    `,
                },

                // {
                //     "type" : "advantages",
                //     "titleAdvantage": "Переваги",
                //     "listAdvantage": ["- Потужна", "- Компактна", "- Простота керування", "- Портативний", "- Свіжий сік за лічені хвилини"]
                // },

                {
                    "type": "photo",
                    "image": mao5
                },

                {
                    "type": "text",
                    "boldType": "Малину 'Мяо-Мяо' висаджують ",
                    "descr": `
                        навесні або восени, головне – обирати сонячне місце з добре дренованим ґрунтом. Перед посадкою рекомендується внести 
                        перегній або компост для кращого розвитку кущів.
                    `,
                },

                // {
                //     "type" : "use",
                //     "titleUse": "Як використовувати ?",
                //     "listUse": [
                //         "1. Натисніть і утримуйте перемикач упродовж 2 секунд для вмикання живлення і скидання, індикатор залишиться увімкненим.",
                //         "2. Покладіть фрукт у чашку (шкірою вгору)",
                //         "3. Поверніть за годинниковою стрілкою, щоб закріпити верхню кришку.",
                //         "4. Натисніть перемикач, для початку приготування соку",
                //         "5. Зачекайте, поки не закінчеться приготування соку",
                //         "6. Помістіть чашку під носик і відкрийте затвор."
                //     ]
                // },



                // {
                //     "type" : "package",
                //     "titlePackage": "Комплектація",
                //     "listPackage": ["Електрична соковичавниця", "USB-кабель", "Заводське паковання"]
                // }
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Вага: ",
                    "descr": "20 г."
                },
                {
                    "title": "Маса ягоди: ",
                    "descr": "12-14 г."
                },
                {
                    "title": "Колір ягоди: ",
                    "descr": "Малиново-червоний"
                },
                {
                    "title": "Смак:",
                    "descr": "Кисло-солодкий"
                },
                {
                    "title": "Період цвітіння:",
                    "descr": "Липень-вересень"
                },
                {
                    "title": "Період плодоношення:",
                    "descr": "З липня до пізньої осені"
                },
                {
                    "title": "Морозостійкість:",
                    "descr": "До -35°C"
                },
                {
                    "title": "Стійкість до хвороб:",
                    "descr": "Висока"
                },
                {
                    "title": "Вимоги до ґрунту: ",
                    "descr": "Невибаглива"
                },
                {
                    "title": "Період посадки (старт):",
                    "descr": "Березень"
                },
                {
                    "title": "Період посадки (кінець):",
                    "descr": "Травень"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Насіння екзотичної малини 'Мяо Мяо' (20 г.)"
        },

        {
            "type": "orderBlock",
            "title": "Насіння екзотичної малини 'Мяо Мяо' (20 г.)",
            "image": mao1,
            "oldPrice": "175",
            "newPrice": "99",
            "quantityList": [
                {
                    "value": 1,
                    "message": "1 уп. за ціною 99 грн",
                    "price": "199"
                },
                {
                    "value": 2,
                    "message": "3 уп. за ціною 2-х уп. - 198 грн.",
                    "price": "398"
                },
                {
                    "value": 4,
                    "message": "6 уп. за ціною 4-х уп. - 396 грн.",
                    "price": "796"
                },
                {
                    "value": 6,
                    "message": "9 уп. за ціною 6-х уп. - 594 грн.",
                    "price": "1194"
                },
                {
                    "value": 7,
                    "message": "більше 10 уп. особлива акція",
                    "price": "залежить від кіл-ті"
                },
            ]
        }
    ],
};



export const pageConfigBarbecue = {
    title: 'Портативний складний мангал-гриль',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Портативний складний мангал-гриль BBQ Grill Portable"
        },
        {
            "type": "promoBlock",
            "src": m17,
            "oldPrice": "1051",
            "newPrice": "599",
        },
        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },
        {
            "type": "descriptionBlock",
            "title": "BBQ Grill Portable складний переносний мангал для дому, дачі та туризму",
            "subtitle": `
                Тепер не потрібно шукати цеглини на пляжі або винаходити саморобні шампури – достатньо взяти з собою ручний мангал 
                і Ви зможете приготувати абсолютно все! 
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": m11
                },
                {
                    "type": "text",
                    "boldType": "Переносний гриль-мангал —",
                    "descr": `
                         дозволяє готувати як на сітці, яка йде в комплекті, так і за допомогою шампурів – достатньо 
                        зняти сітку та встановити шампури. Завдяки нижній сітці під вугіллям циркулює повітря та підтримується 
                        постійний жар. 
                    `
                },
                {
                    "type": "photo",
                    "image": m12
                },
                {
                    "type": "text",
                    "boldType": "Для встановлення мангала",
                    "descr": `
                         потрібно всього кілька секунд - достатньо розкласти його і встановити сітки 
                        та бічні стінки. Розкладний мангал виготовлений із міцного металу та покритий спеціальним жаростійким 
                        покриттям, завдяки якому термін служби збільшується у кілька разів. Конструкція мангала зроблена так, 
                        що на рівній поверхні він дуже стійкий до перекидання.
                    `
                },

                {
                    "type": "photo",
                    "image": m14
                },
                {
                    "type": "text",
                    "boldType": "Гнучкий кран",
                    "descr": `
                         дозволяє з легкістю змінювати напрямок потоку води, а можливість обертання на 360° робить миття посуду ще зручнішим.
                    `
                },
                {
                    "type": "photo",
                    "image": m14
                },
                {
                    "type": "text",
                    "boldType": "Переносний гриль-мангал",
                    "descr": `
                          — це прекрасний вибір для тих, хто цінує свободу, мобільність та смачну їжу навіть під 
                         відкритим небом.⠀Його можна легко перевозити, що дозволяє вам готувати смачні страви на пікніках, кемпінгах, 
                         на пляжі або навіть в парку
                    `
                },
                {
                    "type": "photo",
                    "image": m18
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Габарити: ",
                    "descr": "35 x 27 x 20 см"
                },
                {
                    "title": "Використання:",
                    "descr": "розбірний, легко чистити"
                },
                {
                    "title": "Особливості:",
                    "descr": "багато вентеляційних отворів"
                },
                {
                    "title": "Зручність:",
                    "descr": "швидко збирається, займає мало місця для зберігання"
                },
                {
                    "title": "Покриття корпусу:",
                    "descr": "жаростійка емаль"
                },
                {
                    "title": "Тип:",
                    "descr": "гриль, барбекю"
                },
                {
                    "title": "Форма:",
                    "descr": "прямокутна"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Складний мангал-гриль"
        },

        {
            "type": "orderBlock",
            "title": "Портативний складний мангал-гриль BBQ Grill Portable",
            "image": m17,
            "oldPrice": "1051",
            "newPrice": "599",
            "quantityList": null
        }
    ],
};



// image for wash project
import amPromo from "./helpers/images/wash/am-promo1.png";
import am1 from "./helpers/images/wash/am1.jpeg";
import am2 from "./helpers/images/wash/am2.png";
import am3 from "./helpers/images/wash/am3.jpeg";
import am4 from "./helpers/images/wash/am4.jpeg";
import am5 from "./helpers/images/wash/am5.jpg";
import am6 from "./helpers/images/wash/am6.png";

// image for thanks page in wash project
import w1 from "./helpers/images/thanks/thk-wash/w1.png";
import w2 from "./helpers/images/thanks/thk-wash/w2.png";
import w3 from "./helpers/images/thanks/thk-wash/w3.png";
import w4 from "./helpers/images/thanks/thk-wash/w4.png";
import w5 from "./helpers/images/thanks/thk-wash/w5.png";
import w6 from "./helpers/images/thanks/thk-wash/w6.png";
import w7 from "./helpers/images/thanks/thk-wash/w7.png";
import w8 from "./helpers/images/thanks/thk-wash/w8.png";
import w9 from "./helpers/images/thanks/thk-wash/w9.png";
import w10 from "./helpers/images/thanks/thk-wash/w10.png";
import w11 from "./helpers/images/thanks/thk-wash/w11.png";
import w12 from "./helpers/images/thanks/thk-wash/w12.png";
import w13 from "./helpers/images/thanks/thk-wash/w13.png";
import w14 from "./helpers/images/thanks/thk-wash/w14.png";
import w15 from "./helpers/images/thanks/thk-wash/w15.png";
import w16 from "./helpers/images/thanks/thk-wash/w16.png";
import w17 from "./helpers/images/thanks/thk-wash/w17.png";
import w18 from "./helpers/images/thanks/thk-wash/w18.png";
import w19 from "./helpers/images/thanks/thk-wash/w19.png";
import w20 from "./helpers/images/thanks/thk-wash/w20.png";
import w21 from "./helpers/images/thanks/thk-wash/w21.png";

export const pageConfigWash = {
    title: 'Акумуляторна мийка для очищення та поливання',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Акумуляторна мийка + 2 батареї та пилосос у подарунок"
        },
        {
            "type": "promoBlock",
            "src": amPromo,
            "oldPrice": "2400",
            "newPrice": "1199",
        },
        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },
        {
            "type": "descriptionBlock",
            "title": "Акумуляторний пилосос в подарунок",
            "subtitle": `
                Ідеально чистий салон Вашого автомобіля хавжди! З нашим бездротовим, надійним та зручним автомобільним пилососом,
                що гарантовано забезпечить бездоганну чистоту у будь-який час.
            `,
            "firstImage": am1,
            "marquee": "🎁 + Подарунок Автопилосос Vacuum cleaner 🎁",
            "descrList": [
                {
                    "type": "text",
                    "boldType": "Акумуляторна мийка високого тиску —",
                    "descr": `
                    є потужним і зручним інструментом для чищення та догляду за вашим автомобілем. Бездротовий пістолет 
                    дозволяє вам вільно переміщатися навколо автомобіля під час миття, не обмежуючись довжиною кабелю або розташуванням розетки. 
                    `
                },
                {
                    "type": "photo",
                    "image": am6
                },

                {
                    "type": "text",
                    "boldType": "Завдяки високому тиску води",
                    "descr": `
                         необхідному для миття, акумуляторна автомийка використовує менше води порівняно з традиційним методом миття від шланга.
                    `
                },

                {
                    "type": "photo",
                    "image": am3
                },
                {
                    "type": "photo",
                    "image": am4
                },
                {
                    "type": "text",
                    "boldType": "Міні мийка",
                    "descr": `
                         забезпечує потужний струм води, який легко видаляє бруд, пил і інші забруднення з поверхні автомобіля, забезпечуючи якісне очищення.
                    `
                },
                {
                    "type": "photo",
                    "image": am5
                },
                {
                    "type": "text",
                    "boldType": "Також вона підходить",
                    "descr": `
                           для поливу саду, сільськогосподарського зрошення, побутового прибирання, а також кутів та щілин, які важко очистити вручну. 
                           Передбачено резервуар для миючого засобу для вирішення складніших завдань.
                    `
                },
                {
                    "type": "advantages",
                    "titleAdvantage": "Комплектація",
                    "listAdvantage": [
                        "- Мийка високого тиску", "- З'єднувач змішувача", "- Головка для води – 2 шт", "- Піноутворювач", "- Резервуар",
                        "- Пластиковий фільтр", "- Водопровід 1х5 м", "- Батарея - 2шт", "- Зарядний пристрій", "- Кейс", "- Упаковка",
                        "- + Подарунок Автопилосос Vacuum cleaner"
                    ]
                },

                {
                    "type": "photo",
                    "image": am2
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Габарити: ",
                    "descr": "24 х 24 х 14 см"
                },
                {
                    "title": "Вага:",
                    "descr": "1500 г."
                },
                {
                    "title": "Колір:",
                    "descr": "Чорний"
                },
                {
                    "title": "Живлення:",
                    "descr": "Акумулятор"
                },
                {
                    "title": "Напруга:",
                    "descr": "30В"
                },
                {
                    "title": "Ємність акумулятору:",
                    "descr": "1500 мАг"
                },
                {
                    "title": "Зарядний пристрій напруга:",
                    "descr": "AC 100-240V 50/60Hz"
                },
                {
                    "title": "Потужність:",
                    "descr": "550 Вт"
                },
                {
                    "title": "Витрата води:",
                    "descr": "4 л/хв"
                },
                {
                    "title": "Довжина водопроводу:",
                    "descr": "5 метрів"
                },
                {
                    "title": "Матеріал шайби:",
                    "descr": "Мідь"
                },
                {
                    "title": "Сопла:",
                    "descr": "Пластикові"
                },
            ]
        },

        {
            "type": "reviewsBlock",
            "reviews": [
                {
                    "id": 1, 
                    "name": "Олександр Ярмолюк",
                    "city": "м. Бориспіль",
                    "text": "Відмінно! Дуже дякую"
                },
                {
                    "id": 2, 
                    "name": "Гончар О.",
                    "city": "м. Олександрія",
                    "text": "Замовила чоловіку на подарунок, йому сподобалось"
                },
                {
                    "id": 3, 
                    "name": "Katya Katya",
                    "city": "м. Кропивницький",
                    "text": "10 з 10 дякую"
                },
                {
                    "id": 4, 
                    "name": "Нагорний Ігор",
                    "city": "м. Вінниця",
                    "text": "Мийка хороша, вартує своєї ціни, отримав в подарунок ще й пилосос, то дуже приємно, спасибі"
                },
            ]
        },
        {
            "type": "questionBlock",
            "title": "Акумуляторна мийка + подарунок"
        },

        {
            "type": "orderBlock",
            "title": "Акумуляторна мийка + 2 батареї та пилосос у подарунок",
            "image": amPromo,
            "oldPrice": "2400",
            "newPrice": "1199",
            "quantityList": null
        }
    ],
};

export const thanksPageForWash = [
    {
        id: 5,
        images: [w13, w14, w15],
        title: "Персональний кишеньковий алкотестер з мундштуками, Digital Breath Alcohol Tester",
        old: "599",
        new: "250",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-59%",
        details: [
            {
                t: "Точно показує вміст алкоголю у крові",
                d: ""
            },
            {
                t: "Результати вимірювань відображаються на LED дисплеї",
                d: ""
            },
            {
                t: "Мундшуки в комплекті",
                d: ""
            },
            {
                t: "Швидкі вимірювання",
                d: ""
            },
            {
                t: "Простий у використанні",
                d: ""
            },
        ],
    },
    {
        id: 1,
        images: [w1, w2, w3 ],
        title: "М'яка іграшка на машину Дракон Беззубик 30см, з кріпленням на поверхню",
        old: "699",
        new: "450",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-46%",
        details: [
            {
                t: "Матеріал:",
                d: "Плюш"
            },
            {
                t: "Колір:",
                d: "Чорний"
            },
            {
                t: "Наповнювач:",
                d: "Синтепон"
            },
            {
                t: "Прання:",
                d: "Ручне або машинне"
            },
            {
                t: "Призначення:",
                d: "Кріплення на дах авто, шолом, торпедо, лобове"
            },
        ],
    },
    {
        id: 2,
        images: [w4, w5, w6],
        title: "Магнітний автотримач для телефона, 360°",
        old: "599",
        new: "299",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-51%",
        details: [
            {
                t: "Надійна фіксація",
                d: ""
            },
            {
                t: "Кріплення на дефлектор",
                d: ""
            },
            {
                t: "Швидкий доступ до телефону",
                d: ""
            },
            {
                t: "Сумісність із різними моделями",
                d: ""
            },
            {
                t: "Стильний дизайн",
                d: ""
            },
            {
                t: "Обертання на 360 градусів",
                d: ""
            },
        ],
    },
    {
        id: 3,
        images: [w7, w8, w9],
        title: "Захисна накидка на лобове скло автомобіля (150х70 см)",
        old: "599",
        new: "250",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-59%",
        details: [
            {
                t: "Надійна фіксація",
                d: ""
            },
            {
                t: "Кріплення на дефлектор",
                d: ""
            },
            {
                t: "Швидкий доступ до телефону",
                d: ""
            },
            {
                t: "Сумісність із різними моделями",
                d: ""
            },
            {
                t: "Стильний дизайн",
                d: ""
            },
            {
                t: "Обертання на 360 градусів",
                d: ""
            },
        ],
    },
    {
        id: 4,
        images: [w10, w11, w12],
        title: "Автомобільний зарядний пристрій 2xUSB, HOCO CAR USB DOUBLE Z23",
        old: "450",
        new: "199",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-46%",
        details: [
            {
                t: "Одночасна зарядка двох пристроїв",
                d: ""
            },
            {
                t: "Швидка зарядка в автомобілі",
                d: ""
            },
            {
                t: "Стильний та елегантний дизайн",
                d: ""
            },
            {
                t: "Захист від перегріву",
                d: ""
            },
            {
                t: "Захист від короткого замикання",
                d: ""
            },
            {
                t: "Підключення до автомобільного прикурювача",
                d: ""
            },
        ],
    },
    {
        id: 6,
        images: [w16, w17, w18],
        title: "Комплект чохлів для коліс 4 шт, R13-R16",
        old: "889",
        new: "699",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-22%",
        details: [
            {
                t: "Водонепроникний матеріал",
                d: ""
            },
            {
                t: "Полегшення транспортування",
                d: ""
            },
            {
                t: "Захист від забруднень",
                d: ""
            },
            {
                t: "Ручка для перенесення",
                d: ""
            },
            {
                t: "Підходить для різних розмірів шин",
                d: ""
            },
        ],
    },
    {
        id: 7,
        images: [w19, w20, w21],
        title: "FM-модулятор із зарядкою QC3 (2×USB), від прикурювача",
        old: "599",
        new: "310",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-49%",
        details: [
            {
                t: "Підходить для більшості автомобілів",
                d: ""
            },
            {
                t: "Підтримка швидкого заряджання",
                d: ""
            },
            {
                t: "Висока якість та чистота звуку",
                d: ""
            },
            {
                t: "Одночасна зарядка двох гаджетів",
                d: ""
            },
            {
                t: "Простота підключення до автомобільної аудіосистеми",
                d: ""
            },
            {
                t: "Компактний та легкий",
                d: ""
            },
        ],
    },
];

// Glasses project
import g1 from "./helpers/images/glasses/g1.jpg";
import g2 from "./helpers/images/glasses/g2.jpg";
import g3 from "./helpers/images/glasses/g3.jpg";
import g4 from "./helpers/images/glasses/g4.jpg";
import g5 from "./helpers/images/glasses/g5.jpg";
import g6 from "./helpers/images/glasses/g6.jpg";
import g7 from "./helpers/images/glasses/g7.jpg";

// reviews
import reviews1 from "./helpers/images/reviews-viber/glasses/1.png";
import reviews2 from "./helpers/images/reviews-viber/glasses/2.png";
import reviews3 from "./helpers/images/reviews-viber/glasses/3.png";

// thanks page
import g8 from "./helpers/images/thanks/glasses-thk/g8.png";
import g10 from "./helpers/images/thanks/glasses-thk/g10.png";
import g11 from "./helpers/images/thanks/glasses-thk/g11.png";
import g12 from "./helpers/images/thanks/glasses-thk/g12.png";
import g13 from "./helpers/images/thanks/glasses-thk/g13.png";
import g14 from "./helpers/images/thanks/glasses-thk/g14.png";
import g15 from "./helpers/images/thanks/glasses-thk/g15.png";
import g16 from "./helpers/images/thanks/glasses-thk/g16.png";
import g17 from "./helpers/images/thanks/glasses-thk/g17.png";
import g21 from "./helpers/images/thanks/glasses-thk/g21.png";
import g22 from "./helpers/images/thanks/glasses-thk/g22.png";
import g23 from "./helpers/images/thanks/glasses-thk/g23.png";
import g24 from "./helpers/images/thanks/glasses-thk/g24.png";
import g25 from "./helpers/images/thanks/glasses-thk/g25.png";
import g26 from "./helpers/images/thanks/glasses-thk/g26.png";
import g27 from "./helpers/images/thanks/glasses-thk/g27.png";
import g28 from "./helpers/images/thanks/glasses-thk/g28.png";
import g29 from "./helpers/images/thanks/glasses-thk/g29.png";

export const pageConfigGlasses = {
    title: 'Сонцезахисні поляризовані окуляри антивідблиску Tac Glasses',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Сонцезахисні поляризовані окуляри антивідблиску Tac Glasses"
        },
        {
            "type": "promoBlock",
            "src": g1,
            "oldPrice": "390",
            "newPrice": "199",
        },
        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },
        {
            "type": "descriptionBlock",
            "title": "Сонцезахисні поляризовані тактичні окуляри",
            "subtitle": `
                Сонцезахисні, поляризовані тактичні окуляри - ефективно усувають відбите світло, зберігаючи 
                тільки безпечні для здоров'я людини відтінки жовтого спектра.
            `,
            "firstImage": g2,
            "marquee": "Акційна пропозиція! ☘️ ЗНИЖКА -49% ☘️",
            "descrList": [
                {
                    "type": "text",
                    "boldType": "Сині промені, що сильно подразнюють очі ",
                    "descr": `
                        — окуляри відсівають повністю. Такі окуляри знадобляться для повсякденного життя, 
                        і будуть вкрай корисні для водіїв, спортсменів та людей, які багато працюють за комп'ютером. 
                    `
                },
                {
                    "type": "photo",
                    "image": g3
                },

                {
                    "type": "text",
                    "boldType": "Найбільшу популярність",
                    "descr": `
                         ці окуляри завоювали серед водіїв, адже значно полегшують водіння під час сутінків, 
                         при відбитому світлі фар на мокрому асфальті, а також запобігають засліпленню водіїв 
                         зустрічним транспортом.
                    `
                },

                {
                    "type": "photo",
                    "image": g4
                },
                
                {
                    "type": "text",
                    "boldType": "Ви оціните зручність",
                    "descr": `
                         цих окулярів під час водіння, коли доводиться рухатися в бік заходу сонця.
                    `
                },
                {
                    "type": "photo",
                    "image": g6
                },
                {
                    "type": "text",
                    "boldType": "Поляризовані окуляри",
                    "descr": `
                         з унікальною технологією HD Vision захищають Ваші очі, а також дають змогу бачити набагато чіткіше та контрастніше. 
                        Окуляри захищають Ваші очі від шкідливого впливу ультрафіолетових променів та сонячних відблисків.
                    `
                },
                {
                    "type": "advantages",
                    "titleAdvantage": "Комплектація",
                    "listAdvantage": [
                        "- Окуляри - 1 шт.", "- Чохол - 1 шт.", "- Упаковка", 
                    ]
                },
                {
                    "type": "photo",
                    "image": g5
                },
                {
                    "type": "advantages",
                    "titleAdvantage": "Переваги",
                    "listAdvantage": [
                        "- Стильний сучасний дизайн", 
                        "- Блокують відблиски", 
                        "- Роблять зображення чіткішим на 45%", 
                        "- Збільшують контрастність зображення на 15%", 
                        "- Оптимізують час реакції на 40%", 
                        "- Забезпечують належний рівень комфорту та безпеки", 
                        "- Захист очей від ультрафіолетового випромінювання", 
                         
                    ]
                },

                {
                    "type": "photo",
                    "image": g7
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Ширина: ",
                    "descr": "15 см"
                },
                {
                    "title": "Висота лінзи:",
                    "descr": "4.3 см"
                },
                {
                    "title": "Ширина лінзи:",
                    "descr": "6.8 см"
                },
                {
                    "title": "Довжина подушки:",
                    "descr": "12 см"
                },
                {
                    "title": "Ширина перенісся:",
                    "descr": "1.6 см"
                },
                {
                    "title": "Матеріал:",
                    "descr": "пластик"
                },
                {
                    "title": "Особливості:",
                    "descr": "протиударні, знімні лінзи"
                },
                {
                    "title": "Лінзи:",
                    "descr": "поляризовані, різнокольорові"
                },
                {
                    "title": "Тактична технологія:",
                    "descr": "Colourtune"
                },
            ]
        },

        // {
        //     "type": "reviewsBlock",
        //     "reviews": [
        //         {
        //             "id": 1, 
        //             "name": "Олександр Ярмолюк",
        //             "city": "м. Бориспіль",
        //             "text": "Відмінно! Дуже дякую"
        //         },
        //         {
        //             "id": 2, 
        //             "name": "Гончар О.",
        //             "city": "м. Олександрія",
        //             "text": "Замовила чоловіку на подарунок, йому сподобалось"
        //         },
        //         {
        //             "id": 3, 
        //             "name": "Katya Katya",
        //             "city": "м. Кропивницький",
        //             "text": "10 з 10 дякую"
        //         },
        //         {
        //             "id": 4, 
        //             "name": "Нагорний Ігор",
        //             "city": "м. Вінниця",
        //             "text": "Мийка хороша, вартує своєї ціни, отримав в подарунок ще й пилосос, то дуже приємно, спасибі"
        //         },
        //     ]
        // },
        {
            "type": "questionBlock",
            "title": "Сонцезахисні поляризовані окуляри"
        },

        {
            "type": "viber",
            "title": "Відгуки покупців",
            "images": [reviews1, reviews2, reviews3]
        },

        {
            "type": "orderBlock",
            "title": "Сонцезахисні поляризовані окуляри антивідблиску Tac Glasses",
            "image": g1,
            "oldPrice": "390",
            "newPrice": "199",
            "quantityList": [
                {
                    "value": 1,
                    "message": "1 шт. за ціною 199 грн",
                    "price": "199"
                },
                {
                    "value": 2,
                    "message": "2 шт. зі знижкою 5% - 378 грн.",
                    "price": "378"
                },
                {
                    "value": 3,
                    "message": "3 шт. зі знижкою 10% - 535 грн.",
                    "price": "535"
                },
                {
                    "value": 4,
                    "message": "4 шт. зі знижкою 15% - 675 грн.",
                    "price": "675"
                },
            ]
        }
    ],
};

export const thanksPageForGlasses = [
    {
        id: 1,
        images: [g8, g10, g11],
        title: "Компресор автомобільний AIR COMPRESSOR 260PSI DC-12V",
        old: "599",
        new: "299",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-51%",
        details: [
            {
                t: "Розміри:",
                d: "18,0 см x 18,0 см x 7,1 см"
            },
            {
                t: "Переваги: ",
                d: "Невеликий розмір, простота в експлуатації"
            },
            {
                t: "Використання:",
                d: "для автомобілів, мотоциклів, мячів, гумові човни"
            },
        ],
    },

    {
        id: 3,
        images: [g15, g16, g17],
        title: "Коректор поперекового відділу",
        old: "499",
        new: "199",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-40%",
        details: [
            {
                t: "Ортопедична подушка під спину ПРИЗНАЧЕНА для: ",
                d: ""
            },
            {
                t: "",
                d: "розвантаження поперекового відділу хребта в сидячому положенні;"
            },
            {
                t: "",
                d: "зменшення біль у спині попереку;"
            },
            {
                t: "Ортопедична подушка під спину ПОКАЗАНА для:",
                d: ""
            },
            {
                t: "",
                d: "запобігання невралгіям, остеохондрозу, артрозу поперекового відділу хребта;"
            },
            {
                t: "",
                d: "зняття больового синдрому в попереку у людей з сидячою роботою;"
            },
            {
                t: "",
                d: "розвантаження хребта;"
            },
            {
                t: "",
                d: "забезпечення хорошої постави;"
            },
            {
                t: "",
                d: "підтримки поперекового лордоза у правильному фізіологічному положенні;"
            },
            {
                t: "",
                d: "поліпшення м'язового тонусу."
            },
        ],
    },
    {
        id: 4,
        images: [g22, g23, g21],
        title: "Сонцезахисна шторка на коліщатках для автомобіля 40*60 cм",
        old: "499",
        new: "199",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-40%",
        details: [
            {
                t: "Особливості: ",
                d: ""
            },
            {
                t: "",
                d: "Світловідбивна сторона ефективно захищає від UV-променів та перегріву;"
            },
            {
                t: "",
                d: "Легке встановлення за допомогою присосок;"
            },
            {
                t: "",
                d: "Ви можете регулювати висоту за допомогою фіксатора на присосці;"
            },
            {
                t: "",
                d: "Компактне зберігання у вигляді рулону;"
            },
            {
                t: "",
                d: "Водовідштовхувальна поверхня для легкого догляду;"
            },
            {
                t: "",
                d: "Універсальне використання вдома, в офісі, в автомобілі;"
            },
            {
                t: "",
                d: "Надійно фіксується на склі вікон чи автомобіля;"
            },
            {
                t: "Розмір:",
                d: "60 x 40 cm"
            },
            {
                t: "Матеріал:",
                d: "ПВХ (термопластичний матеріал)"
            },
        ],
    },

    {
        id: 6,
        images: [g27, g28, g29],
        title: "Автомобільний пилосос потужний бездротовий акумуляторний, 4 насадок",
        old: "799",
        new: "599",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-25%",
        details: [
            {
                t: "Потужність: ",
                d: " 150 Вт;"
            },
            {
                t: "Тип живлення: ",
                d: "Акумулятор;"
            },
            {
                t: "Кількість насадок:",
                d: "4 шт;"
            },
            {
                t: "Акумулятор, що знімається: ",
                d: "так"
            },
            {
                t: "Тип використання: ",
                d: "Бездротовий"
            },
            {
                t: "Метод збирання: ",
                d: "Сухе збирання"
            },
            {
                t: "Колір: ",
                d: "Чорний"
            },
        ],
    },
    {
        id: 2,
        images: [g12, g13, g14],
        title: "Паркувальна система | Парктронік на 8 датчиків Car Radar Parking",
        old: "1570",
        new: "799",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-50%",
        details: [
            {
                t: "Відстань визначення перешкод: ",
                d: "0-2,5 м"
            },
            {
                t: "Вертикальний кут визначення перешкод: ",
                d: "90 °"
            },
            {
                t: "Тип виявлення:",
                d: "УЗД (40 кГц)"
            },
            {
                t: "Кількість датчиків:",
                d: "8 ПК"
            },
            {
                t: "Діаметр тіла датчика (внутрішній):",
                d: "2,5 см"
            },
            {
                t: "Довжина датчикового кабелю:",
                d: "4 датчики 2,5 м та 4 датчики 6 м"
            },
            {
                t: "Дисплей:",
                d: "тип - світлодіод"
            },
            {
                t: "Довжина кабелю дисплея:",
                d: "5 м"
            },
            {
                t: "Тип сповіщення драйвера: ",
                d: "візуальний (дисплей) + звук"
            },
            {
                t: "Напруга джерела живлення: ",
                d: "12 В"
            },
            {
                t: "Довжина живлення: ",
                d: "75 см"
            },
            {
                t: "Робоча температура: ",
                d: "від -20 ° C до +70 ° C"
            },
        ],
    },
    {
        id: 5,
        images: [g24, g25, g26],
        title: "Автомобільний двопоршневий компресор із набором інструментів у кейсі YELLOW",
        old: "2900",
        new: "1499",
        saleMessage: "На цей товар також діє акційна пропозиція",
        percent: "-51%",
        details: [
            {
                t: "Тип двигуна: ",
                d: "Електричний;"
            },
            {
                t: "Продуктивність",
                d: "72 л/год;"
            },
            {
                t: "Робоча напруга:",
                d: "12 В;"
            },
            {
                t: "Антивібраційна система: ",
                d: "так"
            },
            {
                t: "Монометр: ",
                d: "так"
            },
            {
                t: "Вага: ",
                d: "1.822 кг"
            },
        ],
    },
];