import promoImage from "./helpers/images/course/1.png";
import firstImage from "./helpers/images/course/2.png";
import secondImage from "./helpers/images/course/3.png";
import thirdImage from "./helpers/images/course/4.png";

export const pageConfig = {
    title: 'Фітнес тренажер для преса і віджимань',
    content: [
        {
            "type": "promoBlock",
            "src": promoImage,
            "oldPrice": "799 грн",
            "newPrice": "599 грн",
        },

        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "descriptionBlock",
            "title": "Ти коли-небудь мріяв про кубики пресу ?",
            "subtitle": `
                Цей компактний і легкий тренажер включає в себе три ключові елементи: дошку для планки, 
                платформу для віджимань та трубчастий еспандер. Поєднуючи ці елементи, тренажер пропонує 
                повноцінне тренування, яке охоплює не тільки м'язи пресу, а й руки, ноги, грудні м'язи, сідниці та спину.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": firstImage
                },
                {
                    "type": "text",
                    "boldType": "Дошка для планки:",
                    "descr": `
                        М'які підлокітники та нековзні ручки забезпечують комфорт та зручність під час виконання вправ. 
                        Вбудований таймер та місце для телефону дозволяють відстежувати час тренування та звільняють від необхідності контролювати час.
                    `
                },
                {
                    "type": "text",
                    "boldType": "Платформа для віджимань: ",
                    "descr": `
                        Сім різних положень для регулювання кута навантаження допомагають націлювати 
                        тренування на різні групи м'язів. Вставні ручки дозволяють легко змінювати положення, збільшуючи ефективність тренувань.
                    `,
                },
                {
                    "type": "text",
                    "boldType": "Трубчастий еспандер: ",
                    "descr": `
                        Ідеальний для тренування м'язів рук і зап'ясть. 
                        Легко приєднується до основи платформи, пропонуючи різноманітні варіанти вправ.
                    `
                },
                {
                    "type": "photo",
                    "image": secondImage
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Фітнес-тренажер для пресу LK202310-17 є ідеальним вибором для тих, хто прагне підтримувати фізичну форму та займатися спортом вдома.
                    `
                },
                {
                    "type": "photo",
                    "image": thirdImage
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Він займає мало місця, легко переміщується та зберігається, що робить його незамінним помічником 
                        у домашніх тренуваннях. На відміну від звичайного ролика для пресу, цей тренажер пропонує різноманіття 
                        вправ та можливість тренувати різні групи м'язів, роблячи кожне тренування максимально ефективним.
                    `
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Модель тренажера:",
                    "descr": "Міні тренажер; домашній; багатофункціональний"
                },
                {
                    "title": "Система навантаження:",
                    "descr": "Механічна; аеродинамічна; ремінна"
                },
                {
                    "title": "Розмір:",
                    "descr": "60 х 30 х 3 см"
                },
                {
                    "title": "Максимальна вага:",
                    "descr": "150 кг"
                },
                {
                    "title": "Матеріал:",
                    "descr": "Пластик"
                },
            ]
        },

        {
            "type": "questionBlock"
        },

        {
            "type": "orderBlock",
            "title": "Фітнес тренажер для преса і віджимань",
            "image": promoImage,
            "oldPrice": "799 грн",
            "newPrice": "599 грн",
        }
    ],
};


