import promoImage from "./helpers/images/course/1.png";
import firstImage from "./helpers/images/course/7.png";
import secondImage from "./helpers/images/course/3.png";
import thirdImage from "./helpers/images/course/4.png";

//Juice 
import promoJuice from "./helpers/images/juice/4.png"
import firstJuice from "./helpers/images/juice/2.png"
import secondJuice from "./helpers/images/juice/3.png"
import thirdJuice from "./helpers/images/juice/1.png"
import fourthJuice from "./helpers/images/juice/5.png"

export const pageConfig = {
    title: 'Фітнес тренажер для преса і віджимань',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Фітнес тренажер для преса і віджимань"
        },
        {
            "type": "promoBlock",
            "src": promoImage,
            "oldPrice": "1100 грн",
            "newPrice": "799 грн",
        },

        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "descriptionBlock",
            "title": "Ти коли-небудь мріяв про кубики пресу ?",
            "subtitle": `
                Цей компактний і легкий тренажер включає в себе три ключові елементи: дошку для планки, 
                платформу для віджимань та трубчастий еспандер. Поєднуючи ці елементи, тренажер пропонує 
                повноцінне тренування, яке охоплює не тільки м'язи пресу, а й руки, ноги, грудні м'язи, сідниці та спину.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": firstImage
                },
                {
                    "type": "text",
                    "boldType": "Дошка для планки:",
                    "descr": `
                        М'які підлокітники та нековзні ручки забезпечують комфорт та зручність під час виконання вправ. 
                        Вбудований таймер та місце для телефону дозволяють відстежувати час тренування та звільняють від необхідності контролювати час.
                    `
                },
                {
                    "type": "text",
                    "boldType": "Платформа для віджимань: ",
                    "descr": `
                        Сім різних положень для регулювання кута навантаження допомагають націлювати 
                        тренування на різні групи м'язів. Вставні ручки дозволяють легко змінювати положення, збільшуючи ефективність тренувань.
                    `,
                },
                {
                    "type": "text",
                    "boldType": "Трубчастий еспандер: ",
                    "descr": `
                        Ідеальний для тренування м'язів рук і зап'ясть. 
                        Легко приєднується до основи платформи, пропонуючи різноманітні варіанти вправ.
                    `
                },
                {
                    "type": "photo",
                    "image": secondImage
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Фітнес-тренажер для пресу LK202310-17 є ідеальним вибором для тих, хто прагне підтримувати фізичну форму та займатися спортом вдома.
                    `
                },
                {
                    "type": "photo",
                    "image": thirdImage
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Він займає мало місця, легко переміщується та зберігається, що робить його незамінним помічником 
                        у домашніх тренуваннях. На відміну від звичайного ролика для пресу, цей тренажер пропонує різноманіття 
                        вправ та можливість тренувати різні групи м'язів, роблячи кожне тренування максимально ефективним.
                    `
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Модель тренажера:",
                    "descr": "Міні тренажер; домашній; багатофункціональний"
                },
                {
                    "title": "Система навантаження:",
                    "descr": "Механічна; аеродинамічна; ремінна"
                },
                {
                    "title": "Розмір:",
                    "descr": "60 х 30 х 3 см"
                },
                {
                    "title": "Максимальна вага:",
                    "descr": "150 кг"
                },
                {
                    "title": "Матеріал:",
                    "descr": "Пластик"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Фітнес тренажер"
        },

        {
            "type": "orderBlock",
            "title": "Фітнес тренажер для преса і віджимань",
            "image": promoImage,
            "oldPrice": "1100 грн",
            "newPrice": "799 грн",
        }
    ],
};



// JUICE PROD
export const pageConfigJuice = {
    title: 'Акумуляторна соковичавниця Citrus Juicer',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Акумуляторна соковичавниця Citrus Juicer"
        },
        {
            "type": "promoBlock",
            "src": promoJuice,
            "oldPrice": "790 грн",
            "newPrice": "499 грн",
        },

        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "descriptionBlock",
            "title": "Захотілося свіжовичавленого соку, але не хочеться витрачатися на кухонний комбайн і Ви не маєте багато місця для його зберігання? ",
            "subtitle": `
                Отже, портативний USB-соковичавниця Citrus Juicer — Ваш вибір! Компактна та потужна, 
                вона за кілька хвилин перетворить будь-який цитрусовий фрукт на смачний і корисний свіжовичавлений сік, 
                а наявність дрібного фільтра дасть змогу відокремити смачну м'якоть і сік від шкірки та кісточок.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": firstJuice
                },
                {
                    "type": "text",
                    "boldType": "Соковичавниця заряджається від кабелю USB",
                    "descr": `
                        і підтримує автономну роботу до 1 години роботи залежно від навантаження. Час повного заряджання становить 
                        майже 2,5 години. Стильний дизайн дасть змогу розмістити пристрій у будь-якому місці кухні, а невеликі розміри дадуть змогу не займати багато місця або взагалі сховати соковичавницю на полицю.
                    `
                },
                {
                    "type": "photo",
                    "image": secondJuice
                },
                {
                    "type": "text",
                    "boldType": "Соковичавниця проста у використанні",
                    "descr": `
                        , просто помийте фрукт, розріжте його на половинки або чверті завантажте в прилад, натисніть кнопку та через хвилинку 
                        насолоджуйтеся склянкою свіжого соку.
                    `,
                },
                
                {
                    "type" : "advantages",
                    "titleAdvantage": "Переваги",
                    "listAdvantage": ["- Потужна", "- Компактна", "- Простота керування", "- Портативний", "- Свіжий сік за лічені хвилини"]
                },

                {
                    "type": "photo",
                    "image": thirdJuice
                },

                {
                    "type" : "use",
                    "titleUse": "Як використовувати ?",
                    "listUse": [
                        "1. Натисніть і утримуйте перемикач упродовж 2 секунд для вмикання живлення і скидання, індикатор залишиться увімкненим.",
                        "2. Покладіть фрукт у чашку (шкірою вгору)",
                        "3. Поверніть за годинниковою стрілкою, щоб закріпити верхню кришку.",
                        "4. Натисніть перемикач, для початку приготування соку",
                        "5. Зачекайте, поки не закінчеться приготування соку",
                        "6. Помістіть чашку під носик і відкрийте затвор."
                    ]
                },
                
                {
                    "type": "photo",
                    "image": fourthJuice
                },

                {
                    "type" : "package",
                    "titlePackage": "Комплектація",
                    "listPackage": ["Електрична соковичавниця", "USB-кабель", "Заводське паковання"]
                }
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Номінальна напруга: ",
                    "descr": "3,7 V"
                },
                {
                    "title": "Номінальний струм: ",
                    "descr": "12 А"
                },
                {
                    "title": "Номінальна потужність: ",
                    "descr": "45 Вт"
                },
                {
                    "title": "Матеріал:",
                    "descr": "ABS-плистик"
                },
                {
                    "title": "Тип батареї:",
                    "descr": "літієва батарея"
                },
                {
                    "title": "Розмір продукту:",
                    "descr": "10,5 x 23,5см"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Акумуляторнa соковичавниця"
        },

        {
            "type": "orderBlock",
            "title": "Акумуляторна соковичавниця Citrus Juicer",
            "image": promoJuice,
            "oldPrice": "790 грн",
            "newPrice": "499 грн",
        }
    ],
};


