const data = {
  "title": "Відкривалка для банок, гвинтова відкривалка для напоїв CAN OPNER LY-451",
  "price:": {
    "old": "399",
    "new": "100"
  },
  "template": "Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам надасть наш менеджер. Ваша розмова може бути записана з метою покращення якостi обслуговування.",
  "descr": [
    {
      "title": "Відкривалка для гвинтових банок (Can Opener LY-451)",
      "subtitle": "Відкривалка Can Opener LY-451 для банок з напоями – це універсальний інструмент для бару, який можна використовувати майже в будь-якій банці. Відкривалка дозволяє відкрити банку без гострих різців, таким чином зберігаючи безпеку. Відкривачка стане чудовим помічником як на домашній, так і професійній кухні, служитиме довго та надійно.",
      "marquee": "Акційна пропозиція! ☘️ ЗНИЖКА -35% ☘️"
    },
    {
      "type": "photo",
      "values": {
        "url": "empty"
      }
    },
    {
      "type": "text",
      "values": {
        "bold": "овлений із харчової н",
        "text": "алі та високоякісного пластику з безконтактною конструкцією для відкриття кришки.  ✅ Вбудоване гостре лезо, гладкий край консервного ножа та безпечна зовнішня конструк"
      }
    },
    {
      "type": "photo",
      "values": {
        "url": "empty"
      }
    },
    {
      "type": "text",
      "values": {
        "bold": "Інструмент для відкриття банок",
        "text": "непримітний кухонний гаджет, але дуже ефективний."
      }
    },
    {
      "type": "photo",
      "values": {
        "url": "empty"
      }
    },
    {
      "type": "advantages",
      "values": {
        "title": "Переваги:"
      }
    },
    {
      "type": "point",
      "values": {
        "point": "Безпека матеріалів"
      }
    },
    {
      "type": "point",
      "values": {
        "point": "Безпечно у використанні"
      }
    },
    {
      "type": "point",
      "values": {
        "point": "За відкривалкою для консервних банок легко доглядати - достатньо вимити вручну водою "
      }
    },
    {
      "type": "point",
      "values": {
        "point": "Підходить для щоденного відкриття банок з пивом та газировкою."
      }
    }
  ],
  "question": "question?",
  "viber": "",
  "order": [
    "",
    "2 шт. зі знижкою 5% - 739 грн.",
    "2 шт. зі знижкою 5% - 739 грн.",
    "2 шт. зі знижкою 5% - 739 грн."
  ],
  "details": [
    {
      "type": "details",
      "values": "Тип: відкривання;"
    },
    {
      "type": "details",
      "values": "Призначення: для бляшанок, пляшок;"
    },
    {
      "type": "details",
      "values": "Матеріал: нержавіюча сталь;"
    },
    {
      "type": "details",
      "values": "Розмір: 8.8 х 6.8 х 1.9 см;"
    },
    {
      "type": "details",
      "values": "Легко відкриває пляшки та банки"
    }
  ]
}