import k1 from "./helpers/images/faucet/k1.png"
import k2 from "./helpers/images/faucet/k2.png"
import k3 from "./helpers/images/faucet/k3.png"
import k4 from "./helpers/images/faucet/k4.png"
import k5 from "./helpers/images/faucet/k5.png"

export const pageConfigBbq = {
    title: 'Стильний кухонний змішувач Matte Black',
    content: [
        {
            "type": "basicHeaderBlock",
            "title": "Стильний кухонний змішувач Matte Black"
        },
        {
            "type": "promoBlock",
            "src": k1,
            "oldPrice": "2199 грн",
            "newPrice": "1499 грн",
        },

        {
            "type": "timerBlock",
            "text": `
                Цiну знижено через випуск нової моделi. Додаткову iнформацiю Вам 
                надасть наш менеджер. Ваша розмова може бути записана з метою 
                покращення якостi обслуговування.
            `
        },

        {
            "type": "descriptionBlock",
            "title": "Гнучкий кран з обертанням потоку в 360 градусів",
            "subtitle": `
                Стильний кухонний змішувач Matte Black поєднує цікавий дизайн і зручність у використанні.
                Ця модель чудово підійде для кухонь, виконаних у стилі ганьби-тік.
                Завдяки високому силіконовому виливу миття великої кількості посуду та продуктів більше не буде проблемою.
            `,
            "descrList": [
                {
                    "type": "photo",
                    "image": k4
                },
                {
                    "type": "text",
                    "boldType": "Плавна зручна форма",
                    "descr": `
                         робить процес догляду за змішувачем набагато простішим.
                        Сучасна та практична модель, яка стане чудовим доповненням кухні.
                        Спробуйте першим, крокуйте в ногу з часом!
                    `
                },
                {
                    "type": "photo",
                    "image": k3
                },
                {
                    "type": "text",
                    "boldType": null,
                    "descr": `
                        Елегантний та практичний кухонний змішувач Matte Black ідеально доповнить кухню в сучасному стилі.
                        Гнучкий кран дозволяє з легкістю змінювати напрямок потоку води, а можливість обертання на 360° робить миття посуду ще зручнішим.
                        Високоякісні матеріали гарантують довговічність та надійність у щоденному використанні.
                    `
                },
                {
                    "type": "photo",
                    "image": k5
                },
            ]
        },

        {
            "type": "detailsBlock",
            "details": [
                {
                    "title": "Функція:",
                    "descr": "змішувач для кухонної раковини"
                },
                {
                    "title": "Тип клапана:",
                    "descr": "керамічний клапан"
                },
                {
                    "title": "Матеріал корпусу:",
                    "descr": "латунь"
                },
                {
                    "title": "Матеріал ручки:",
                    "descr": "латунь"
                },
                {
                    "title": "Матеріал головки розпилювача:",
                    "descr": "АБС-пластик З 2 трубами для холодної та гарячої води."
                },
                {
                    "title": "Стиль:",
                    "descr": "модерн"
                },
                {
                    "title": "Оснащення:",
                    "descr": "з витяжною лійкою"
                },
                {
                    "title": "Підключення:",
                    "descr": "до водопроводу"
                },
                {
                    "title": "Класифікація змішувачів:",
                    "descr": "для кухні"
                },
                {
                    "title": "Вилив:",
                    "descr": "Висувний, довгий, гнучкий"
                },
            ]
        },

        {
            "type": "questionBlock",
            "title": "Кухонний змішувач"
        },

        {
            "type": "orderBlock",
            "title": "Фітнес тренажер для преса і віджимань",
            "image": k1,
            "oldPrice": "2199 грн",
            "newPrice": "1499 грн",
        }
    ],
};